{
  "version": "1.0",
  "courseInfo": {
    "title": "Matriz Curricular Interativa",
    "name": "Engenharia de Energia",
    "institution": "CEFET/MG Campus Curvelo"
  },
  "totalPeriods": 10,
  "courses": [
    {
      "id": "G10CFVR0.01",
      "nome": "Cálculo com Funções de uma Variável Real",
      "ch": "90h",
      "periodo": 1,
      "eixo": "Matemática",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Funções Reais: polinomiais, modulares, exponenciais e logarítmicas, trigonométricas e trigonométricas inversas. Limites e continuidade. Derivadas: conceito, regras de derivação e diferenciais. Aplicações de derivadas: taxas relacionadas, esboço de gráficos e otimização. Primitivas elementares.",
      "bibliografiaBasica": [
        "FLEMMING, Diva Marília; GONÇALVES, Mírian Buss. Cálculo A: funções, limite, derivação e integração. 6. ed. rev. e ampl. São Paulo: Pearson Prentice Hall, c2007.",
        "THOMAS, George Brinton; WEIR, Maurice D.; HASS, Joel. Cálculo: volume 1. 12. ed. São Paulo: Pearson Education do Brasil, c2013.",
        "STEWART, James. Cálculo: volume 1. 7. ed. São Paulo: Cengage Learning, c2014."
      ],
      "bibliografiaComplementar": [
        "LEITHOLD, Louis. O cálculo com geometria analítica. 3. ed. São Paulo: Harbra, c1994. v. 1.",
        "IEZZI, Gelson; MURAKAMI, Carlos. Fundamentos de matemática elementar, 1: conjuntos, funções. 8. ed. São Paulo: Atual, 2004.",
        "IEZZI, Gelson; DOLCE, Osvaldo; MURAKAMI, Carlos. Fundamentos de matemática elementar, 2: logaritmos. 9. ed. São Paulo: Atual, 2004.",
        "IEZZI, Gelson. Fundamentos de matemática elementar, 3: trigonometria. 8. ed. São Paulo: Atual, 2004.",
        "IEZZI, Gelson. Fundamentos de matemática elementar, 6: complexos, polinômios, equações. 7. ed. São Paulo: Atual, 2005."
      ],
      "horas": 75,
      "creditos": 6,
      "Sigla": "CFVR",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10GAAL0.01",
      "nome": "Geometria Analítica e Álgebra Linear",
      "ch": "60h",
      "periodo": 1,
      "eixo": "Matemática",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Matrizes, sistemas de equações lineares e determinantes. Algebra vetorial. Retas e planos. Espaços vetoriais em R2 e R3. Autovalores e autovetores de matrizes. Diagonalização de matrizes. Cônicas.",
      "bibliografiaBasica": [
        "BOLDRINI, José Luiz. Álgebra linear. 3. ed. São Paulo: Harbra, c1986.",
        "BOULOS, Paulo. Geometria analítica: um tratamento vetorial. 3. ed. São Paulo: Pearson Education do Brasil, 2005.",
        "WINTERLE, Paulo. Geometria analítica. 2. ed. São Paulo: Pearson Makron Books, c1987."
      ],
      "bibliografiaComplementar": [
        "CALLIOLI, Carlos A.; DOMINGUES, Hygino H.; COSTA, Roberto C. F. Álgebra linear e aplicações. 6. ed. reform. São Paulo: Atual, c1990.",
        "LANG, Serge. Álgebra linear. Rio de Janeiro: Ciência Moderna, c2003.",
        "STENINBRUCH, Alfredo. WINTERLE, Paulo. Álgebra linear. 2. ed. São Paulo: Pearson Education do Brasil, c1987.",
        "SANTOS, Nathan Moreira dos. Vetores e matrizes: uma introdução à álgebra linear. 4. ed. São Paulo: Cencage Learning, c2007.",
        "POOLE, David. Álgebra linear. São Paulo: Cengage Learning, c2004."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "GAAL",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10QUIM0.01",
      "nome": "Química",
      "ch": "60h",
      "periodo": 1,
      "eixo": "Física e Química",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Estrutura atômica. Propriedades periódicas dos elementos. Propriedades físico-químicas dos elementos e compostos. Ligações químicas. Reações químicas. Cálculos estequiométricos. Teoria ácido-base. Soluções. Termoquímica. Eletroquímica.",
      "bibliografiaBasica": [
        "BROWN, Theodore L. [et al.]. Química: a ciência central. São Paulo: Editora Pearson, 2017.",
        "KOTZ, J.C.; TREICHEL, P., TOWNSEND, J. R., TREICHEL, D. A. Química geral e reações químicas. 3. ed. São Paulo, CENGAGE LEARNING, 2016, v. 1.",
        "LIMA, Ana Luiza Lorenzen. Estudos de eletroquímica: reações químicas e energia. Editora Intersaberes, 2020."
      ],
      "bibliografiaComplementar": [
        "ATKINS, P.; LORETA, J., LAVERMAN, L. Princípios de Química: questionando a vida e o meio ambiente. 5. ed. São Paulo: Bookman, 2012.",
        "NERI, Kátia Dias; SOUSA, Marcia Cristina de. Análise instrumental inorgânica. Editora Intersaberes, 2022.",
        "KOTZ, J.C.; TREICHEL, P., TOWNSEND, J. R., TREICHEL, D. A. Química geral e reações químicas. 3. ed. São Paulo, Cengage Learning, 2016, v. 2.",
        "MAHAN, B.H. Química um curso universitário. São Paulo: Edgard Blucher, 1995.",
        "MASTERTAN, W. L.; SLOWINSKI, E. J.; STANISTKI, C. L. Princípios de química. 6. ed. Rio de Janeiro: LTC, 2012."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "QuiG",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10LQUI0.01",
      "nome": "Laboratório de Química",
      "ch": "30h",
      "periodo": 1,
      "eixo": "Física e Química",
      "prerequisitos": [],
      "corequisitos": [
        "G10QUIM0.01"
      ],
      "ementa": "Organização e funcionamento de um laboratório. Normas e procedimentos de segurança, incluindo primeiros socorros. Técnicas básicas de laboratório, manuseio de vidrarias e equipamentos de uso comum. Avaliação de resultados experimentais. Propriedades físico-químicas dos compostos. Soluções. Reações Químicas. Eletroquímica e Corrosão.",
      "bibliografiaBasica": [
        "OLIVEIRA, Marcelo Ribeiro leite de; BRAATHEN, Per Christian. Laboratório de química inorgânica: Volume 1. Viçosa (MG): UFV, 2003.",
        "NERI, Kátia Dias; SOUSA, Marcia Cristina de. Análise instrumental inorgânica. Editora Intersaberes, 2022.",
        "CIENFUEGOS, Freddy. Segurança no laboratório. Rio de Janeiro: Interciência, 2001."
      ],
      "bibliografiaComplementar": [
        "ROQUETO, M. A. Química experimental: manual de aula prática. 1. ed. Curitiba. Editorial CRV, 2020.",
        "TRINDADE, Diamantino Fernandes et al. Química básica experimental. 4. ed. São Paulo: Ícone, 2010.",
        "CHRISPINO, Álvaro; FARIA, Pedro. Manual de química experimental. Campinas, SP: Átomo, 2010.",
        "SILVA, R. R.; BOCCHI, N.; ROCHA-FILHO, R., MACHADO, P. F. Introdução à química experimental. 3. ed. São Paulo. EDUFSCar, 2021.",
        "MORITA, T. Assumpção, R. M. V. Manual de soluções, reagentes e solventes. 2. ed. São Paulo: Editora Edgard Blucher, 2007."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LQG",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10PCOM1.01",
      "nome": "Programação de Computadores I",
      "ch": "30h",
      "periodo": 1,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [],
      "corequisitos": [
        "G10LPCO1.01"
      ],
      "ementa": "Conceitos básicos de software, hardware e dado. Conceitos básicos de organização de computadores. Conceitos de algoritmo, programa e linguagem de programação. Programação estruturada: variáveis, tipos básicos de dados, expressões, comandos, entrada e saída de dados, comandos de fluxo de controle, estruturas de dados homogêneas, estruturas de dados heterogêneas, funções, recursividade.",
      "bibliografiaBasica": [
        "DEITEL, Harvey M. Java: como programar. 8. ed. São Paulo: Pearson Prentice Hall, 2010.",
        "FORBELLONE, André Luiz Villar. Lógica de programação: a construção de algoritmos e estruturas de dados. 3. ed. São Paulo: Pearson Education do Brasil, 2005.",
        "PURGA, Sandra; RISSETTI, Gerson. Lógica de programação e estrutura de dados, com aplicações em Java. 2. ed. São Paulo: Pearson, 2016."
      ],
      "bibliografiaComplementar": [
        "ASCENCIO, Ana Fernanda Gomes; CAMPOS, Edilene Aparecida Veneruchi de. Fundamentos da programação de computadores: algoritmos, Pascal, C/C++ (padrão Ansi) e java. 3. ed. São Paulo: Pearson, 2012.",
        "FURGERI, Sérgio. Java 7: ensino didático. 2. ed. São Paulo: Érica, 2014.",
        "WIRTH, Niklaus. Algoritmos e estruturas de dados. Rio de Janeiro: LTC, 2009.",
        "MANZANO, José Augusto N. G.; OLIVEIRA, Jayr Figueiredo de. Algoritmos: lógica para desenvolvimento de programação de computadores. 27. ed. rev. São Paulo: Érica, 2014.",
        "ANSELMO, Fernando. Aplicando lógica orientada a objetos em Java: da lógica à certificação. 3. ed. Florianópolis: Visual Books, 2013."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "PC1",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10LPCO1.01",
      "nome": "Laboratório de Programação de Computadores I",
      "ch": "30h",
      "periodo": 1,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [],
      "corequisitos": [
        "G10PCOM1.01"
      ],
      "ementa": "Práticas em laboratório dos temas e tópicos abordados na disciplina Programação de Computadores I.",
      "bibliografiaBasica": [
        "DEITEL, Harvey M. Java: como programar. 8. ed. São Paulo: Pearson Prentice Hall, 2010.",
        "FORBELLONE, André Luiz Villar. Lógica de programação: a construção de algoritmos e estruturas de dados. 3. ed. São Paulo: Pearson Education do Brasil, 2005.",
        "PURGA, Sandra; RISSETTI, Gerson. Lógica de programação e estrutura de dados, com aplicações em Java. 2. ed. São Paulo: Pearson, 2016."
      ],
      "bibliografiaComplementar": [
        "ASCENCIO, Ana Fernanda Gomes; CAMPOS, Edilene Aparecida Veneruchi de. Fundamentos da programação de computadores: algoritmos, Pascal, C/C++ (padrão Ansi) e java. 3. ed. São Paulo: Pearson, 2012.",
        "FURGERI, Sérgio. Java 7: ensino didático. 2. ed. São Paulo: Érica, 2014.",
        "WIRTH, Niklaus. Algoritmos e estruturas de dados. Rio de Janeiro: LTC, 2009.",
        "MANZANO, José Augusto N. G.; OLIVEIRA, Jayr Figueiredo de. Algoritmos: lógica para desenvolvimento de programação de computadores. 27. ed. rev. São Paulo: Érica, 2014.",
        "ANSELMO, Fernando. Aplicando lógica orientada a objetos em Java: da lógica à certificação. 3. ed. Florianópolis: Visual Books, 2013."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LPC1",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10LPTA0.01",
      "nome": "Leitura e Produção de Textos Acadêmicos",
      "ch": "30h",
      "periodo": 1,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Estratégias de leitura. O texto e suas condições de produção. O texto, os elementos de textualidade e os processos argumentativos. Produção e recepção de textos técnicos e científicos, tais como: esquema, resumo, resenha, fichamento, relatório, artigo, entre outros que circulam na esfera de atividade social em que atuará o profissional do curso. Autoria e autonomia na produção textual. Reflexão sobre o plágio. O gerenciamento de vozes e o trabalho com citações.",
      "bibliografiaBasica": [
        "FARACO, Carlos Alberto; FARACO, Carlos Alberto. Prática de texto: para estudantes universitários. 21. ed. Petrópolis: Vozes, 2011.",
        "FIORIN, José Luiz; SAVIOLI, Francisco Platão. Para entender o texto: leitura e redação. 17. ed. São Paulo: Ática, 2007.",
        "MACHADO, Anna Rachel (coord.). Planejar gêneros acadêmicos. São Paulo: Parábola, 2005."
      ],
      "bibliografiaComplementar": [
        "MACHADO, A. R.; LOUSADA, E.; ABREU-TARDELLI, L. S. Resenha. São Paulo: Parábola Editorial, 2005.",
        "MACHADO, A. R.; LOUSADA, E.; ABREU-TARDELLI, L. S. Resumo. São Paulo: Parábola Editorial, 2005.",
        "GONÇALVES, Carlos Alberto; MEIRELLES, Anthero de Moraes. Projetos e relatórios de pesquisa em administração. São Paulo: Atlas, 2004.",
        "SAVIOLI, Francisco Platão. Gramática em 44 lições: com mais de 1700 exercícios. 32. ed. São Paulo: Ática, 2002.",
        "BECHARA, Evanildo. Moderna gramática portuguesa. 37. ed. rev. e ampl. Rio de Janeiro: Lucerna, 2009."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LPTA",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ENSU0.01",
      "nome": "Energia e Sustentabilidade",
      "ch": "30h",
      "periodo": 1,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Energia, desenvolvimento e meio ambiente. O conceito de desenvolvimento sustentável. As empresas e o desenvolvimento sustentável. Conscientização da sociedade civil perante os problemas energéticos. Ações governamentais. Esforços globais e posicionamento no mercado. Responsabilidades sociais e ambientais. Responsabilidade socioambiental corporativa. Características dos empreendimentos energéticos sustentáveis (capaz de perdurar no tempo, geração de bons resultados econômicos, contribuição ao crescimento da sociedade, contribuição à preservação e conservação do meio ambiente). Políticas públicas ambientais. Ecoeficiência (maximização da eficiência energética, uso de energias de fontes renováveis, conservação dos recursos naturais, eliminação ou minimização da geração de emissões, efluentes ou resíduos, reciclagem e reaproveitamento de materiais).",
      "bibliografiaBasica": [
        "DIAS, R. Gestão Ambiental: Responsabilidade Social e Sustentabilidade. 3. ed. São Paulo: Atlas, 2017.",
        "GOLDEMBERG, J.; LUCON, O. S. (Coord.) Energia, meio ambiente e desenvolvimento. 3. ed. São Paulo: Edusp, 2011.",
        "HINRICHS, R. A.; KLEINBACH, M.; REIS, L. B. Energia e meio ambiente. 5. ed. São Paulo: Cengage Learning, 2015."
      ],
      "bibliografiaComplementar": [
        "FARRET, F. A. Aproveitamento de pequenas fontes de energia. 3. ed. Santa Maria: UFSM, 2014.",
        "REIS, L. B.; FADIGAS, E. A. F. A.; CARVALHO, C. E. Energia, recursos naturais e a prática do desenvolvimento sustentável. 3. ed. Barueri: Manole, 2019.",
        "SANTOS, R. F. Planejamento ambiental: teoria e prática. São Paulo: Oficina de Textos, 2004.",
        "TACHIZAWA, T. Gestão Ambiental e Responsabilidade Social Corporativa: Os paradigmas do novo contexto empresarial. 9. ed. São Paulo: Atlas, 2019.",
        "VEIGA, J. E. Desenvolvimento sustentável: o desafio do século XXI. 3. ed. Rio de Janeiro: Garamond, 2008."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "ESUS",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10CSEE0.01",
      "nome": "Contexto Social e Profissional da Engenharia de Energia",
      "ch": "30h",
      "periodo": 1,
      "eixo": "Prática Profissional e Formação Diversificada",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "O Curso de Engenharia de Energia e o espaço de atuação do engenheiro de energia; cenários da Engenharia de Energia no Brasil e no mundo; conceituação e áreas da Engenharia de Energia; o sistema profissional da Engenharia de Energia: regulamentos, normas e ética profissional; desenvolvimento técnico e tecnológico e o processo de estudo e de pesquisa; interação com outros ramos da área de tecnologia; mercado de trabalho; ética e cidadania.",
      "bibliografiaBasica": [
        "CARDOSO, J. R. e GRIMONI, J. A. B. Introdução à Engenharia - Uma Abordagem Baseada em Ensino por Competências, 1 ed. LTC, 2021.",
        "BAZZO, W. A.; PEREIRA; L. T. V. Introdução à engenharia: conceitos, ferramentas e comportamentos. Florianópolis: Ed. UFSC. 2006.",
        "HOLTZAPPLE, M. T., REECE, W. D. Introdução à engenharia. Rio Janeiro. LTC, 1 ed. 2017."
      ],
      "bibliografiaComplementar": [
        "CONFEA. Resolução nº 1073, de 19 de abril de 2016.",
        "CONSELHO FEDERAL DE ENGENHARIA E AGRONOMIA (org.). Código de Ética Profissional da Engenharia, da Agronomia, da Geologia, da Geografia e da Meteorologia. 11. ed. Brasília: CONFEA, 2019.",
        "BRASIL. Congresso Nacional. Lei No. 5.194, de 24 de dezembro de 1966.",
        "CONFEA. Resolução nº 1.025, de 30 de outubro de 2009.",
        "Bahman ZOHURI. Introduction to Energy Essentials: Insight Into Nuclear, Renewable, and Non-Renewable Energies, 1 Ed. Academic Press, 2021."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "CSPEE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10CFVV1.01",
      "nome": "Cálculo com Funções de Várias Variáveis I",
      "ch": "60h",
      "periodo": 2,
      "eixo": "Matemática",
      "prerequisitos": [
        "G10CFVR0.01",
        "G10GAAL0.01"
      ],
      "corequisitos": [],
      "ementa": "Coordenadas polares. Superfícies quádricas. Funções reais de várias variáveis: limites, continuidade, gráficos, curvas e superfícies de níveis. Derivadas parciais: conceito, cálculo e aplicações. Introdução aos Números Complexos e Fórmula de Euler.",
      "bibliografiaBasica": [
        "THOMAS, George Brinton; WEIR, Maurice D. Cálculo: volume 2. 12. ed. São Paulo: Pearson Education do Brasil, c2013. v. 2",
        "STEWART, James. Cálculo: volume 2. 7. ed. São Paulo: Cengage Learning, c2014. v. 2",
        "LEITHOLD, Louis. O cálculo com geometria analítica. 3. ed. São Paulo: Harbra, c1994. v. 2"
      ],
      "bibliografiaComplementar": [
        "SIMMONS, George F. Cálculo com geometria analítica. São Paulo: Pearson Makron Books, 1988. v. 2.",
        "FLEMMING, Diva Marília. Cálculo B: funções de variáveis, integrais múltiplas, integrais curvilíneas e de superfície. 2. ed. rev. e ampl. São Paulo: Pearson Prentice Hall, c2007.",
        "ANTON, HOWARD; BIVENS, Irl; DAVIS, Stephen. Cálculo. 10. ed. Porto Alegre: Bookman, 2014. ν. 2",
        "SWOKOWSKI, Earl William. Cálculo: com geometria analítica. 2. ed. São Paulo: Makron Books, 1995, v. 2",
        "MUNEM, Mustafa A.; FOULIS, David J. Cálculo. Rio de Janeiro: Guanabara Dois, 1986. v. 2"
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "CVV1",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10INSE0.01",
      "nome": "Integração e Séries",
      "ch": "60h",
      "periodo": 2,
      "eixo": "Matemática",
      "prerequisitos": [
        "G10CFVR0.01"
      ],
      "corequisitos": [],
      "ementa": "Integrais definidas: conceito, Teorema Fundamental do Cálculo e aplicações. Integrais indefinidas: conceito e métodos de integração. Integrais impróprias. Sequências e séries numéricas. Séries de potências, séries de Taylor e aplicações.",
      "bibliografiaBasica": [
        "THOMAS, George Brinton; WEIR, Maurice D.; HASS, Joel. Cálculo: volume 1 e 2. 12. ed. São Paulo: Pearson Education do Brasil, c2013. 2 v",
        "FLEMMING, Diva Marília; GONÇALVES, Mírian Buss. Cálculo A: funções, limite, derivação e integração. 6. ed. rev. e ampl. São Paulo: Pearson Prentice Hall, c2007.",
        "STEWART, James. Cálculo: volume 1. 7. ed. São Paulo: Cengage Learning, c2014. v.1"
      ],
      "bibliografiaComplementar": [
        "STEWART, James. Cálculo: volume 2. 7. ed. São Paulo: Cengage Learning, c2014. v. 2",
        "LEITHOLD, Louis. O cálculo com geometria analítica. 3. ed. São Paulo: Harbra, c1994. v. 1",
        "LEITHOLD, Louis. O cálculo com geometria analítica. 3. ed. São Paulo: Harbra, c1994. v. 2",
        "SIMMONS, George F. Cálculo com geometria analítica. São Paulo: Pearson Education do Brasil, c1987. v.1",
        "SIMMONS, George F. Cálculo com geometria analítica. São Paulo: Pearson Makron Books, 1988. v. 2"
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "IntS",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10FMEC0.01",
      "nome": "Fundamentos de Mecânica",
      "ch": "60h",
      "periodo": 2,
      "eixo": "Física e Química",
      "prerequisitos": [
        "G10CFVR0.01",
        "G10GAAL0.01"
      ],
      "corequisitos": [],
      "ementa": "Cinemática em uma dimensão e no espaço; princípios da dinâmica; aplicações das leis de Newton; trabalho e energia mecânica; conservação da energia; momento linear e conservação do momento linear; momento angular e conservação do momento angular; dinâmica dos corpos rígidos. Equilíbrio e Elasticidade.",
      "bibliografiaBasica": [
        "HALLIDAY, David; RESNICK, Robert; WALKER, Jearl. Fundamentos de física, volume 1: Mecânica. 9. ed. Rio de Janeiro: LTC, 2012.",
        "YOUNG, H. D.; FREEDMAN, R. A. Sears & Zemansky: Física I: mecânica. 12. ed. São Paulo: Addison Wesley, 2009.",
        "TIPLER, P.; MOSCA, G. Física para cientistas e engenheiros: mecânica, oscilações e ondas, termodinâmica. 6. ed. Rio de Janeiro: LTC, 2009. v. 1."
      ],
      "bibliografiaComplementar": [
        "NUSSENZVEIG, H. M. Curso de física básica: mecânica. 4. ed. São Paulo: Edgard Blücher, 2002.",
        "CHAVES, A.; SAMPAIO, J. F. Física básica: mecânica. Rio de Janeiro: LTC/LAB, 2007.",
        "HEWIT, G. PAUL. Física Conceitual. 9. ed. Porto Alegre: Bookman, 2002.",
        "FEYNMAN, R. P.; SANDS, M.; LEIGHTON, R. B. Lições de física de Feynman. Porto Alegre: Bookman, 2008. v.1.",
        "SERWAY, R. A.; JEWETT JR., J. W. Princípios de física: volume 1: mecânica clássica. 3. ed. São Paulo: Thomson, 2004."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "FMEC",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10FEME0.01",
      "nome": "Física Experimental - Mecânica",
      "ch": "30h",
      "periodo": 2,
      "eixo": "Física e Química",
      "prerequisitos": [],
      "corequisitos": [
        "G10FMEC0.01"
      ],
      "ementa": "Práticas em laboratório de temas e tópicos abordados nas disciplinas básicas de Física, mais especificamente, experimentos na área de Mecânica.",
      "bibliografiaBasica": [
        "CAMPOS, A. A.; ALVES, E. S.; SPEZIALI, N. L. Física experimental básica na universidade. 2. ed., rev. Belo Horizonte: UFMG, 2008.",
        "HALLIDAY, David; RESNICK, Robert; WALKER, Jearl. Fundamentos de física, volume 1: Mecânica. 9. ed. Rio de Janeiro: LTC, 2012.",
        "YOUNG, H. D.; FREEDMAN, R. A. Sears & Zemansky: física I: mecânica. 12. ed. São Paulo: Addison Wesley, 2009."
      ],
      "bibliografiaComplementar": [
        "TIPLER, P.; MOSCA, G. Física para cientistas e engenheiros: mecânica, oscilações e ondas, termodinâmica. 6. ed. Rio de Janeiro: LTC, 2009. v. 1.",
        "CHAVES, A.; SAMPAIO, J. F. Física básica: mecânica. Rio de Janeiro: LTC/LAB, 2007.",
        "HEWIT, G. PAUL. Física Conceitual. Porto Alegre: Bookman, 2002.",
        "FEYNMAN, R. P.; SANDS, M.; LEIGHTON, R. B. Lições de física de Feynman. Porto Alegre: Bookman, 2008. v. 1.",
        "SERWAY, R. A.; JEWETT JR., J. W. Princípios de física: volume 1: mecânica clássica. 3. ed. São Paulo: Thomson, 2004."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "FEM",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10PRCO2.01",
      "nome": "Programação de Computadores II",
      "ch": "30h",
      "periodo": 2,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [
        "G10PCOM1.01",
        "G10LPCO1.01"
      ],
      "corequisitos": [
        "G10LPCO2.01"
      ],
      "ementa": "Programação orientada a objetos. Ocultação de informação e encapsulamento. Objetos, classes, atributos, métodos e visibilidade. Associações de objetos, herança, classes abstratas e polimorfismo. Exceções. Arquivos. Recursos de aplicações matemáticas e gráficas.",
      "bibliografiaBasica": [
        "DEITEL, Harvey M. Java: como programar. 8. ed. São Paulo: Pearson Prentice Hall, 2010.",
        "RANGEL, Pablo. Sistemas orientados a objetos: teoria e prática com UML e Java. la ed. Rio de Janeiro: Brasport. 2021.",
        "BARNES, David J. Programação Orientada a Objetos com Java: uma introdução prática utilizando o Blue J. 4. ed. São Paulo: Pearson, 2009."
      ],
      "bibliografiaComplementar": [
        "ANSELMO, Fernando. Aplicando lógica orientada a objetos em Java: da lógica à certificação. 3. ed. Florianópolis: Visual Books, 2013.",
        "SANTOS, Rafael. Introdução à programação orientada a objetos usando Java. 2. ed. Rio de Janeiro: Elsevier, 2013.",
        "FURGERI, Sérgio. Java 7: ensino didático. 2. ed. São Paulo: Érica, 2014.",
        "DEITEL, Paul J. C++: como programar. 5. ed. São Paulo: Pearson Education do Brasil, c2006.",
        "FÉLIX, Rafael. Programação orientada a objetos. 1. ed. São Paulo: Person. 2016."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "PC2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10LPCO2.01",
      "nome": "Laboratório de Programação de Computadores II",
      "ch": "30h",
      "periodo": 2,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [
        "G10PCOM1.01",
        "G10LPCO1.01"
      ],
      "corequisitos": [
        "G10PRCO2.01"
      ],
      "ementa": "Práticas em laboratório dos temas e tópicos abordados na disciplina Programação de Computadores II.",
      "bibliografiaBasica": [
        "DEITEL, Harvey M. Java: como programar. 8. ed. São Paulo: Pearson Prentice Hall, 2010.",
        "RANGEL, Pablo. Sistemas orientados a objetos: teoria e prática com UML e Java. la ed. Rio de Janeiro: Brasport. 2021.",
        "BARNES, David J. Programação Orientada a Objetos com Java: uma introdução prática utilizando o Blue J. 4. ed. São Paulo: Pearson, 2009."
      ],
      "bibliografiaComplementar": [
        "ANSELMO, Fernando. Aplicando lógica orientada a objetos em Java: da lógica à certificação. 3. ed. Florianópolis: Visual Books, 2013.",
        "SANTOS, Rafael. Introdução à programação orientada a objetos usando Java. 2. ed. Rio de Janeiro: Elsevier, 2013.",
        "FURGERI, Sérgio. Java 7: ensino didático. 2. ed. São Paulo: Érica, 2014.",
        "DEITEL, Paul J. C++: como programar. 5. ed. São Paulo: Pearson Education do Brasil, c2006.",
        "FÉLIX, Rafael. Programação orientada a objetos. 1. ed. São Paulo: Person. 2016."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LP2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10DTAC0.01",
      "nome": "Desenho Técnico Assistido por Computador",
      "ch": "30h",
      "periodo": 2,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "O uso do computador como ferramenta para a produção gráfica visando: a aplicação das normas do desenho técnico, a formatação de papel com legenda, a diferenciação de traços, o desenho em perspectiva, as projeções ortográficas, o uso de escalas, as representações de simetria e a aplicação de cotas.",
      "bibliografiaBasica": [
        "SILVEIRA, S. J. da. AutoCAD 2020, Brasport, 2020.",
        "RIBEIRO, A. C.; PERES, M. P. Curso de Desenho Técnico e AutoCAD. Editora Pearson, 2013.",
        "SILVA, A., RIBEIRO, C. T., DIAS, J., SOUSA, L. Desenho Técnico Moderno. 4ª. ed. LTC, c2006."
      ],
      "bibliografiaComplementar": [
        "LEAKE, J. M., BORGERSON, J. L. Manual de Desenho Técnico para Engenharia Desenho, Modelagem e Visualização, LTC, c2015.",
        "MORAIS, L. K. da S. de. Autocad 2010 2D Básico. Ed. Viena, 2010.",
        "C. H. SIMMONS, D. E. MAGUIRE, Desenho Técnico. Hemus, c2004.",
        "RIBEIRO, A. C., PERES, M. P., NACIR, I. Curso de Desenho Técnico e Autocad, Pearson Education do Brasil, c2013.",
        "MICELI, M. T. Desenho Técnico: Básico. 4a. ed. Imperial Novo Milênio, 2010."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "DTAC",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10SDIG0.01",
      "nome": "Sistemas Digitais",
      "ch": "30h",
      "periodo": 2,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Portas lógicas: tipos e aplicações. Circuitos combinatórios: análise, síntese, técnicas de minimização e aplicações. Aritmética digital: operações e circuitos. Elementos de memória: flip-flop e registradores. Circuitos sequenciais e aplicações. Dispositivos de memória. Princípios de conversão A/D e D/A.",
      "bibliografiaBasica": [
        "FLOYD, T. L. Sistemas digitais: fundamentos e aplicações. 9ª ed. Porto Alegre: Bookman, 2007.",
        "IDOETA, I. V.; CAPUANO, F. G. Elementos de eletrônica digital. 42a ed. São Paulo: Érica, 2018.",
        "TOCCI, R. J.; WIDMER, N. S.; MOSS, G. L. Sistemas digitais: princípios e aplicações. 12ª ed. São Paulo: Pearson do Brasil, 2019."
      ],
      "bibliografiaComplementar": [
        "BIGNELL, J.; DONOVAN, R. Eletrônica Digital. 5ª ed. São Paulo: Cengage Learning, 2009.",
        "COSTA, C., MESQUITA, L., PINHEIRO, E. Elementos de Lógica Programável com VHDL e DSP: Teoria e Prática. 1ª ed. São Paulo: Érica, 2011.",
        "D'AMORE, R. VHDL: Descrição e Síntese de Circuitos Digitais. 2ª Ed. Editora LTC. 2012.",
        "DACHI, É.; HAUPT, A. Eletrônica digital. 1ª ed. Blucher, 2016.",
        "UYEMURA, J. P. Sistemas digitais: Uma Abordagem Integrada. 1ª ed. São Paulo: Thomson, 2002."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "SD",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10LSDI0.01",
      "nome": "Laboratório de Sistemas Digitais",
      "ch": "30h",
      "periodo": 2,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [],
      "corequisitos": [
        "G10SDIG0.01"
      ],
      "ementa": "Ferramentas para análise, desenvolvimento e depuração de projetos eletrônicos. Dispositivos lógicos programáveis. Linguagem de descrição de hardware. Análise e projeto de sistemas digitais de média complexidade: combinatórios e sequenciais.",
      "bibliografiaBasica": [
        "COSTA, C., MESQUITA, L., PINHEIRO, E. Elementos de Lógica Programável com VHDL e DSP: Teoria e Prática. 1ª ed. São Paulo: Érica, 2011.",
        "D'AMORE, R. VHDL: Descrição e Síntese de Circuitos Digitais. 2ª Ed. Editora LTC. 2012.",
        "PEDRONI, V. A. Eletrônica Digital Moderna e VHDL. Editora Elsevier. 2010."
      ],
      "bibliografiaComplementar": [
        "BIGNELL, J.; DONOVAN, R. Eletrônica Digital. 5ª ed. São Paulo: Cengage Learning, 2009.",
        "FLOYD, T. L. Sistemas digitais: fundamentos e aplicações. 9ª ed. Porto Alegre: Bookman, 2007.",
        "IDOETA, I. V.; CAPUANO, F. G. Elementos de eletrônica digital. 42. ed. São Paulo: Érica, 2018.",
        "TOCCI, R. J.; WIDMER, N. S.; MOSS, G. L. Sistemas digitais: princípios e aplicações. 12ª ed. São Paulo: Pearson do Brasil, 2019.",
        "VAHID, F. Sistemas Digitais: Projeto, Otimização e HDLs. 1ª ed. Porto Alegre: Bookman. 2008."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LSD",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10CFVV2.01",
      "nome": "Cálculo com Funções de Várias Variáveis II",
      "ch": "60h",
      "periodo": 3,
      "eixo": "Matemática",
      "prerequisitos": [
        "G10CFVV1.01",
        "G10INSE0.01"
      ],
      "corequisitos": [],
      "ementa": "Integrais duplas: conceito, cálculo, mudanças de coordenadas cartesianas para polares e aplicações. Integrais triplas: conceito, cálculo, mudanças de coordenadas cartesianas para cilíndricas e esféricas, e aplicações. Comprimento de arco de curva parametrizada. Campos vetoriais, campo gradiente, Rotacional e Divergente. Integrais curvilíneas e de superfície. Teoremas integrais: Green, Gauss e Stokes.",
      "bibliografiaBasica": [
        "THOMAS, George Brinton; WEIR, Maurice D. Cálculo: volume 2. 12. ed. São Paulo: Pearson Education do Brasil, c2013. v. 2",
        "STEWART, James. Cálculo: volume 2. 7. ed. São Paulo: Cengage Learning, c2014. 2v., il.",
        "SIMMONS, George F. Cálculo com geometria analítica. São Paulo: Pearson Makron Books, 1988. 2 v"
      ],
      "bibliografiaComplementar": [
        "LEITHOLD, Louis. O cálculo com geometria analítica. 3. ed. São Paulo: Harbra, c1994. 2 V.",
        "FLEMMING, Diva Marília. Cálculo B: funções de variáveis, integrais múltiplas, integrais curvilíneas e de superfície. 2. ed. rev. e ampl. São Paulo: Pearson Prentice Hall, c2007.",
        "ANTON, HOWARD; BIVENS, Irl; DAVIS, Stephen. Cálculo. 10. ed. Porto Alegre: Bookman, 2014. v. 2",
        "SWOKOWSKI, Earl William. Cálculo: com geometria analítica. 2. ed. São Paulo: Makron Books, 1995. v.2",
        "MUNEM, Mustafa A.; FOULIS, David J. Cálculo. Rio de Janeiro: Guanabara Dois, 1986. v. 2"
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "CVV2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10EDOR0.01",
      "nome": "Equações Diferenciais Ordinárias",
      "ch": "60h",
      "periodo": 3,
      "eixo": "Matemática",
      "prerequisitos": [
        "G10CFVV1.01",
        "G10INSE0.01"
      ],
      "corequisitos": [],
      "ementa": "Equações diferenciais ordinárias de primeira ordem: resolução e aplicações; Equações diferenciais ordinárias de segunda ordem: resolução e aplicações; e Equações diferenciais ordinárias de ordem superior; sistemas de equações diferenciais; Transformada de Laplace e sua aplicação em equações diferenciais.",
      "bibliografiaBasica": [
        "ZILL, Dennis G. Equações diferenciais: com aplicações em modelagem. 3. ed. São Paulo: Cencage Learning, 2016.",
        "BOYCE, William E; DIPRIMA, Richard C. Equações diferenciais elementares e problemas de valores de contorno. 9. ed. Rio de Janeiro: LTC, c2010.",
        "NAGLE, R. KENT; SAFF, EDWAR B. Equações Diferenciais. 8. ed. São Paulo: Editora Pearson, 2012."
      ],
      "bibliografiaComplementar": [
        "AYRES JÚNIOR, Frank. Equações diferenciais. Rio de Janeiro: McGraw Hill do Brasil, 1970. (Coleção Schaum).",
        "LEIGHTON, Walter. Equações diferenciais ordinárias. Rio de Janeiro: LTC, 1970.",
        "OLIVEIRA, Rafael Lima. Equações diferenciais ordinárias: métodos de resolução e aplicações. Curitiba: Editora Intersaberes, 2019.",
        "ABUNAHMAN, Sérgio Antônio. Equações diferenciais. Rio de Janeiro: EDC-Editora Didática e Científica, 1989.",
        "EDWARDS, C. H.; PENNEY, David E. Equações diferenciais elementares com problemas de contorno. 3. ed. Rio de Janeiro: Prentice Hall do Brasil, 1995."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "EDO",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10FOFT0.01",
      "nome": "Fundamentos de Oscilações, Fluidos e Termodinâmica",
      "ch": "60h",
      "periodo": 3,
      "eixo": "Física e Química",
      "prerequisitos": [
        "G10FMEC0.01"
      ],
      "corequisitos": [
        "G10EDOR0.01",
        "G10FEOFT0.01"
      ],
      "ementa": "Estática e dinâmica dos fluidos; Movimento periódico; Ondas Mecânicas; Som e Audição; Temperatura; calor; 1ª e 2ª leis da termodinâmica; Propriedade dos gases; Teoria cinética dos gases; Transferência de calor e massa.",
      "bibliografiaBasica": [
        "HALLIDAY, David; RESNICK, Robert; WALKER, Jearl. Fundamentos de física, volume 2: gravitação, ondas e termodinâmica. 9. ed. Rio de Janeiro: LTC, c2012.",
        "YOUNG, H. D.; FREEDMAN, R. A. Sears & Zemansky: física II: termodinâmica e ondas. 12. ed. São Paulo: Addison Wesley, 2009.",
        "TIPLER, P.; MOSCA, G. Física para cientistas e engenheiros: mecânica, oscilações e ondas, termodinâmica. 6. ed. Rio de Janeiro: LTC, 2009. v. 1."
      ],
      "bibliografiaComplementar": [
        "NUSSENZVEIG, H. M. Curso de física básica: fluidos, oscilações e ondas, calor. 5. ed. São Paulo: Edgard Blücher, 2014.",
        "CHAVES, A. Física básica: gravitação, fluidos, ondas, termodinâmica. Rio de Janeiro: LTC: LAB, 2007.",
        "HEWIT, G. PAUL. Física Conceitual. Porto Alegre: Bookman, 2002.",
        "FEYNMAN, R. P.; SANDS, M.; LEIGHTON, R. B. Lições de física de Feynman. Porto Alegre: Bookman, 2008. v. 1.",
        "SERWAY, Raymond A.; JEWETT JR., John W. Princípios de física: volume 2: oscilações, ondas e termodinâmica. São Paulo: Cencage Learning, c2015."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "OFT",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10FEOFT0.01",
      "nome": "Física Experimental - OFT",
      "ch": "30h",
      "periodo": 3,
      "eixo": "Física e Química",
      "prerequisitos": [],
      "corequisitos": [
        "G10FOFT0.01"
      ],
      "ementa": "Práticas em laboratório de temas e tópicos abordados nas disciplinas básicas de Física, mais especificamente, experimentos nas áreas de Oscilações, Fluidos e Termodinâmica.",
      "bibliografiaBasica": [
        "CAMPOS, A. A.; ALVES, E. S.; SPEZIALI, N. L. Física experimental básica na universidade. 2. ed., rev. Belo Horizonte: UFMG, 2008.",
        "HALLIDAY, David; RESNICK, Robert; WALKER, Jearl. Fundamentos de física, volume 2: gravitação, ondas e termodinâmica. 9. ed. Rio de Janeiro: LTC, c2012.",
        "YOUNG, H. D.; FREEDMAN, R. A. Sears & Zemansky: física II: termodinâmica e ondas. 12. ed. São Paulo: Addison Wesley, 2009."
      ],
      "bibliografiaComplementar": [
        "TIPLER, P.; MOSCA, G. Física para cientistas e engenheiros: mecânica, oscilações e ondas, termodinâmica. 6. ed. Rio de Janeiro: LTC, 2009. v. 1.",
        "CHAVES, A. Física básica: gravitação, fluidos, ondas, termodinâmica. Rio de Janeiro: LTC: LAB, 2007.",
        "HEWIT, G. PAUL. Física Conceitual. Porto Alegre: Bookman, 2002.",
        "FEYNMAN, R. P.; SANDS, M.; LEIGHTON, R. B. Lições de física de Feynman. Porto Alegre: Bookman, 2008. v. 1.",
        "ERWAY, Raymond A.; JEWETT JR., John W. Princípios de física: volume 2: oscilações, ondas e termodinâmica. São Paulo: Cencage Learning, c2015."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "FEOFT",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10CIMA0.01",
      "nome": "Ciências dos Materiais",
      "ch": "30h",
      "periodo": 3,
      "eixo": "Física e Química",
      "prerequisitos": [
        "G10QUIM0.01",
        "G10LQUI0.01"
      ],
      "corequisitos": [],
      "ementa": "Classificação dos materiais; estados da matéria; ligação química e estrutura atômica; estudo das ligas metálicas; formação das estruturas de arranjo cristalino nos sólidos; sistemas cristalinos; defeitos cristalinos, planos atômicos, diagramas de equilíbrio; estudo do diagrama ferro carbono; diagramas de transformação isotérmica, microestrutura dos metais; propriedades físicas, químicas e mecânicas dos materiais.",
      "bibliografiaBasica": [
        "CALLISTER JUNIOR, William D. Ciência e engenharia de materiais: uma introdução. 5. ed. Rio Janeiro: LTC, 2002.",
        "CALLISTER JUNIOR., William D. Fundamentos da ciência e engenharia de materiais: uma abordagem integrada. 2. ed. Rio de Janeiro: LTC, 2006.",
        "VAN VLACK, Lawrence H. Princípios de ciência e tecnologia dos materiais. 4. ed. atual. e ampl. Rio de Janeiro: Campus, c1984."
      ],
      "bibliografiaComplementar": [
        "ASKELAND, Donald R. The science and engineering of materials: solutions manual. 3. ed. London: Chapman & Hall, 1996.",
        "SMITH, William F. Princípios de ciência e engenharia dos materiais. 3. ed. Lisboa: McGraw-Hill, 1998.",
        "PADILHA, Ângelo Fernando. Materiais de engenharia: microestrutura e propriedades. São Paulo: Hemus, 1997.",
        "SCHMIDT, Walfredo. Materiais Elétricos: condutores e semicondutores. 3. ed. São Paulo: Blucher, 2010.",
        "SCHMIDT, Walfredo. Materiais Elétricos: isolantes e magnéticos. 4. ed. São Paulo: Blucher, 2019."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "CMAT",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10MNCO0.01",
      "nome": "Métodos Numéricos Computacionais",
      "ch": "60h",
      "periodo": 3,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [
        "G10PCOM1.01",
        "G10LPCO1.01"
      ],
      "corequisitos": [
        "G10EDOR0.01"
      ],
      "ementa": "Erros; diferenças finitas; métodos iterativos; interpolação e aproximação de funções; integração numérica; resolução numérica de equações algébricas e transcendentes; sistemas algébricos lineares; resolução numérica de equações diferenciais ordinárias; utilização de softwares de análise numérica.",
      "bibliografiaBasica": [
        "CAMPOS, Frederico Ferreira. Algoritmos numéricos. 2. ed. Rio de Janeiro: LTC, 2007.",
        "FRANCO, Neide Bertoldi. Cálculo numérico. São Paulo: Pearson Prentice Hall, c2007.",
        "RUGGIERO, Márcia A. Gomes; LOPES, Vera Lúcia da Rocha. Cálculo numérico: aspectos teóricos e computacionais. 2. ed. São Paulo: Pearson Makron Books, c1997."
      ],
      "bibliografiaComplementar": [
        "GILAT, Amos; SUBRAMANIAM, Vish. Métodos numéricos para engenheiros e cientistas: uma introdução com aplicações usando o MATLAB. Porto Alegre: Bookman, 2008.",
        "CHAPRA, Steven C.; CANALE, Raymond P. Métodos numéricos para engenharia. 7. ed. São Paulo: McGraw Hill, 2016.",
        "SPERANDIO, Décio; MENDES, João Teixeira; SILVA, Luiz Henry Monken e. Cálculo numérico: características matemáticas e computacionais dos métodos numéricos. São Paulo: Prentice Hall, 2003.",
        "BURDEN, Richard L. Análise numérica. São Paulo: Cengage Learning, 2008.",
        "BARROSO, Leônidas Conceição et al. Cálculo numérico: (com aplicações). 2. ed. São Paulo: Harbra, c1987."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "MNC",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10CELE0.01",
      "nome": "Circuitos Elétricos",
      "ch": "60h",
      "periodo": 3,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [
        "G10CFVV1.01",
        "G10INSE0.01"
      ],
      "corequisitos": [
        "G10EDOR0.01"
      ],
      "ementa": "Tensão e corrente elétrica. Fontes de tensão e de corrente contínuas. Resistência elétrica. Indutância. Capacitância. Leis de Kirchhoff. Divisor de tensão e divisor de corrente. Técnicas de análise de circuitos: correntes de malha, tensões de nó, circuitos equivalentes de Thevenin e de Northon e superposição. Fonte de tensão senoidal. Circuitos no domínio do tempo. Resposta do circuito em corrente alternada senoidal (ca). Valor médio e valor eficaz. Circuito no domínio da frequência. Fasores e diagrama fasorial. Impedância e admitância. Potência em circuitos de ca: aparente, ativa e reativa. Fator de potência. Ressonância. Técnicas de análise de circuitos em ca. Máxima transferência de potência. Geração trifásica. Cargas trifásicas equilibradas e desequilibradas. Potência em circuitos trifásicos.",
      "bibliografiaBasica": [
        "O'MALLEY, JOHN R. Análise de Circuitos. 2. ed. São Paulo. Bookman. 2014.",
        "ROBERT L. BOYLESTAD. Introdução à análise de circuitos. Editora Pearson, 2018.",
        "NAHVI, M., EDMINISTER, J. A. Teoria e problemas de circuitos elétricos. 4. ed. Porto Alegre: Bookman, 2005."
      ],
      "bibliografiaComplementar": [
        "HAYT JÚNIOR, WILLIAM H. Análise de circuitos em engenharia. São Paulo: McGraw-Hill, 1975.",
        "NILSSON, JAMES W, REIDEL, SUSAN A. Circuitos elétricos. 8. ed. Rio de Janeiro: Pearson Education do Brasil, 2009.",
        "MARKUS, OTÁVIO. Circuitos elétricos: corrente contínua e corrente alternada. 9. ed. São Paulo: Érica, 2014.",
        "JOHNSON, DAVID E. Fundamentos de análise de circuitos elétricos. 4. ed. Rio de Janeiro: Prentice-Hall, c1994.",
        "ALEXANDER, CHARLES K. Fundamentos de circuitos elétricos. 5. ed. Porto Alegre: AMGH, 2013."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "CE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10LCEL0.01",
      "nome": "Laboratório de Circuitos Elétricos",
      "ch": "30h",
      "periodo": 3,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [],
      "corequisitos": [
        "G10CELE0.01"
      ],
      "ementa": "Verificações experimentais de tópicos abordados em Circuitos Elétricos e simulações computacionais.",
      "bibliografiaBasica": [
        "O'MALLEY, JOHN R. Análise de Circuitos. 2. ed. São Paulo. Bookman. 2014.",
        "ROBERT L. BOYLESTAD. Introdução à análise de circuitos. Editora Pearson, 2018.",
        "NAHVI, M., EDMINISTER, J. A. Teoria e problemas de circuitos elétricos. 4. ed. Porto Alegre: Bookman, 2005."
      ],
      "bibliografiaComplementar": [
        "HAYT JÚNIOR, WILLIAM H. Análise de circuitos em engenharia. São Paulo: McGraw-Hill, 1975.",
        "NILSSON, JAMES W, REIDEL, SUSAN A. Circuitos elétricos. 8. ed. Rio de Janeiro: Pearson Education do Brasil, 2009.",
        "MARKUS, OTÁVIO. Circuitos elétricos: corrente contínua e corrente alternada. 9. ed. São Paulo: Érica, 2014.",
        "JOHNSON, DAVID E. Fundamentos de análise de circuitos elétricos. 4. ed. Rio de Janeiro: Prentice-Hall, c1994.",
        "ALEXANDER, CHARLES K. Fundamentos de circuitos elétricos. 5. ed. Porto Alegre: AMGH, 2013."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LCE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10EDPA0.01",
      "nome": "Equações Diferenciais Parciais",
      "ch": "60h",
      "periodo": 4,
      "eixo": "Matemática",
      "prerequisitos": [
        "G10EDOR0.01"
      ],
      "corequisitos": [],
      "ementa": "Séries de Fourier; Equações diferenciais parciais; Equações da onda, do calor e de Laplace; Transformada de Fourier e sua aplicação em equações diferenciais parciais.",
      "bibliografiaBasica": [
        "ZILL, Dennis G. Equações diferenciais: com aplicações em modelagem. 3. ed. São Paulo: Cencage Learning, 2016.",
        "BOYCE, William E; DIPRIMA, Richard C. Equações diferenciais elementares e problemas de valores de contorno. 9. ed. Rio de Janeiro: LTC, c2010.",
        "NAGLE, R. KENT; SAFF, EDWAR B. Equações Diferenciais. 8. ed. São Paulo: Editora Pearson, 2012."
      ],
      "bibliografiaComplementar": [
        "AYRES JÚNIOR, Frank. Equações diferenciais. Rio de Janeiro: McGraw Hill do Brasil, 1970. (Coleção Schaum).",
        "LEIGHTON, Walter. Equações diferenciais ordinárias. Rio de Janeiro: LTC, 1970.",
        "ROJAS, M.R.A. Introdução às equações diferenciais parciais. Curitiba: Editora Intersaberes, 2020.",
        "ABUNAHMAN, Sérgio Antônio. Equações diferenciais. Rio de Janeiro: EDC-Editora Didática e Científica, 1989.",
        "EDWARDS, C. H.; PENNEY, David E. Equações diferenciais elementares com problemas de contorno. 3. ed. Rio de Janeiro: Prentice Hall do Brasil, 1995."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "EDP",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10FELE0.01",
      "nome": "Fundamentos de Eletromagnetismo",
      "ch": "60h",
      "periodo": 4,
      "eixo": "Física e Química",
      "prerequisitos": [
        "G10FOFT0.01",
        "G10CFVV2.01"
      ],
      "corequisitos": [
        "G10FEEL0.01"
      ],
      "ementa": "Carga elétrica e matéria; lei de Coulomb; o campo elétrico; fluxo elétrico e lei de Gauss; potencial elétrico; capacitores e dielétricos; corrente elétrica; resistência elétrica; força eletromotriz; circuitos de corrente contínua e regras de Kirchhoff; campo magnético; lei de Biot-Savart; lei de Ampère; indução eletromagnética; lei de Faraday; indutância e energia do campo magnético; circuitos de corrente alternada; equações de Maxwell.",
      "bibliografiaBasica": [
        "HALLIDAY, David; RESNICK, Robert. Fundamentos de física, volume 3: Eletromagnetismo. 9. ed. Rio de Janeiro: LTC, с2012.",
        "YOUNG, H. D.; FREEDMAN, R. A. Sears & Zemansky: física III: eletromagnetismo. 12. ed. São Paulo: Addison Wesley, 2009.",
        "TIPLER, P.; MOSCA, G. Física para cientistas e engenheiros: eletricidade e magnetismo, óptica. 6. ed. Rio de Janeiro: LTC, 2009. v. 2."
      ],
      "bibliografiaComplementar": [
        "NUSSENZVEIG, H. M. Curso de física básica: eletromagnetismo. 2. ed. rev. São Paulo: Edgard Blücher, 2014.",
        "CHAVES, A. Física básica: eletromagnetismo. Rio de Janeiro: LTC: LAB, 2007.",
        "HEWIT, G. PAUL. Física Conceitual. Porto Alegre: Bookman, 2002.",
        "FEYNMAN, R. P.; SANDS, M.; LEIGHTON, R. B. Lições de física de Feynman. Porto Alegre: Bookman, 2008. v.2",
        "SERWAY, R. A.; JEWETT JR., J. W. Princípios de física: eletromagnetismo. 5. ed. São Paulo: Thomson, 2015."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "FEMAG",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10FEEL0.01",
      "nome": "Física Experimental - Eletromagnetismo",
      "ch": "30h",
      "periodo": 4,
      "eixo": "Física e Química",
      "prerequisitos": [],
      "corequisitos": [
        "G10FELE0.01"
      ],
      "ementa": "Práticas em laboratório de temas e tópicos abordados nas disciplinas básicas de Física, mais especificamente, experimentos na área de Eletromagnetismo.",
      "bibliografiaBasica": [
        "CAMPOS, A. A.; ALVES, E. S.; SPEZIALI, N. L. Física experimental básica na universidade. 2. ed., rev. Belo Horizonte: UFMG, 2008.",
        "HALLIDAY, David; RESNICK, Robert. Fundamentos de física, volume 3: Eletromagnetismo. 9. ed. Rio de Janeiro: LTC, c2012.",
        "YOUNG, H. D.; FREEDMAN, R. A. Sears & Zemansky: física III: eletromagnetismo. 12. ed. São Paulo: Addison Wesley, 2009."
      ],
      "bibliografiaComplementar": [
        "TIPLER, P.; MOSCA, G. Física para cientistas e engenheiros: eletricidade e magnetismo, óptica. 6. ed. Rio de Janeiro: LTC, 2009. v. 2.",
        "CHAVES, A. Física básica: eletromagnetismo. Rio de Janeiro: LTC: LAB, 2007.",
        "HEWIT, G. PAUL. Física Conceitual. Porto Alegre: Bookman, 2002.",
        "FEYNMAN, R. P.; SANDS, M.; LEIGHTON, R. B. Lições de física de Feynman. Porto Alegre: Bookman, 2008. v.2",
        "SERWAY, R. A.; JEWETT JR., J. W. Princípios de física: volume 3: eletromagnetismo. 5. ed. São Paulo: Thomson, 2015."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "FEEM",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10EAEN0.01",
      "nome": "Estatística Aplicada à Engenharia",
      "ch": "45h",
      "periodo": 4,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [
        "G10INSE0.01"
      ],
      "corequisitos": [],
      "ementa": "Fundamentos de Inferência Estatística. Inferências para Médias e Desvios Padrões. Testes estatísticos. Intervalos de confiança para uma e duas amostras. Modelos e análise de variância. Transformação de dados. Testes de comparação de médias. Grupos de experimentos. Regressão. Análise de covariância. Controle estatístico de processo. Softwares de estatística.",
      "bibliografiaBasica": [
        "MONTGOMERY, Douglas C.; RUNGER, George C. Estatística aplicada e probabilidade para engenheiros. 5. ed. Rio de Janeiro: LTC, с2012.",
        "BUSSAB, W. O.; MORETTIN, P. A. Estatística básica. 8. ed. São Paulo: Saraiva, 2013.",
        "FONSECA, J. S.; MARTINS, G. A.; TOLEDO, G. L. Estatística aplicada. 2. ed. São Paulo: Atlas, c1985."
      ],
      "bibliografiaComplementar": [
        "SPIEGEL, Murray R; STEPHENS, Larry J. Estatística. 4. ed. Porto Alegre: Bookman, 2009.",
        "LOURENÇO FILHO, R. C. B. Controle estatístico da qualidade. Rio de Janeiro: Livro Técnico, 1970.",
        "MORETTIN, Luiz Gonzaga. Estatística básica: probabilidade e inferência: volume único. São Paulo: Pearson Prentice Hall, 2010.",
        "SOARES, J. F. Introdução à estatística. Rio de Janeiro: LTC, 1991.",
        "COSTA NETO, P. L. O. Estatística. 2. ed. São Paulo: Edgard Blücher, 2002."
      ],
      "horas": 37,
      "creditos": 3,
      "Sigla": "EST",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10IINS1.01",
      "nome": "Inglês Instrumental I",
      "ch": "30h",
      "periodo": 4,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Compreensão e produção escrita de textos em língua inglesa de gêneros textuais variados, com foco nos gêneros acadêmicos, científicos e profissionais. Reconhecimento das características dos gêneros textuais. Desenvolvimento de habilidades de leitura (competências e conhecimentos) através da aplicação de estratégias, produção e retextualização escrita de gêneros textuais.",
      "bibliografiaBasica": [
        "MURPHY, Joseph. English grammar in use: a self-study reference and practice book for elementary students of english, with answers. 3rd. Cambridge, Mass.: Cambridge University Press, 2004.",
        "SANTOS, Denise. Como ler melhor em inglês. Barueri: Disal, c2011.",
        "SWAN, Michael. Practical english usage. 3rd Oxford: Oxford University Press, 2005."
      ],
      "bibliografiaComplementar": [
        "PASSWORD: k dictionaries: english dictionary for speakers of portuguese. 2. ed. São Paulo: Martins Fontes, 1998.",
        "OSHIMA, Alice; HOGUE, Ann. Writing academic english. 4. ed. White Plains: Pearson Longman, c2006.",
        "NETTLE, Mark; HOPKINS, Diana. Developing grammar in context: intermediate with answers. Cambridge: Cambridge University Press, 2003.",
        "LONGMAN dictionary of contemporary English: for advanced learners. 5. ed. Harlow: Pearson Education, 2009.",
        "MURPHY, Raymond; SMALZER, William R. Grammar in use intermediate. 3. ed. Cambridge; New York: Cambridge University Press, 2009."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "ING1",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10IDIR0.01",
      "nome": "Introdução ao Direito",
      "ch": "30h",
      "periodo": 4,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10LPTA0.01"
      ],
      "corequisitos": [],
      "ementa": "Sistema constitucional brasileiro; Noções básicas de direito civil, empresarial, administrativo, trabalho e tributário; Regulamentação profissional.",
      "bibliografiaBasica": [
        "FERRAZ JUNIOR, T. S. Introdução ao estudo do direito: técnica, decisão, dominação. 9. ed. São Paulo: Atlas, 2018.",
        "FUHRER, M. C. A.; MILAIRE, E. Manual de direito público e privado. 21. ed. São Paulo: Revista dos Tribunais, 2015.",
        "MARTINS, Sérgio Pinto. Instituições de direito público e privado. 15. ed. São Paulo: Atlas, 2015."
      ],
      "bibliografiaComplementar": [
        "MACHADO, Hugo de Brito. Introdução ao estudo do direito. 3. ed. São Paulo: Atlas, 2012.",
        "MONTORO, Andre Franco. Introdução à ciência do direito. 33. ed. São Paulo: Revista dos Tribunais, 2016.",
        "NASCIMENTO, A. M.; PINHO, R. R. Instituições de direito público e privado. 24. ed. São Paulo: Atlas, 2004.",
        "REALE, Miguel. Lições preliminares de direito. 27. ed. São Paulo: Saraiva, 2002.",
        "VENOSA, S. S. Introdução ao estudo do direito. 7. ed. São Paulo: Atlas, 2022."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "IDIR",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10TERM0.01",
      "nome": "Termodinâmica",
      "ch": "60h",
      "periodo": 4,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10FOFT0.01"
      ],
      "corequisitos": [],
      "ementa": "Relações Básicas e a Primeira Lei da Termodinâmica. A Segunda Lei da Termodinâmica. Análise de Disponibilidade. Análise de Disponibilidade de Ciclos. Equações de Estado. Relações de Propriedades Termodinâmicas. A Terceira Lei da Termodinâmica. Propriedades Termodinâmicas de Misturas Homogêneas. Sistemas Multicomponentes Multifásicos. Reações Químicas. Disponibilidade Química. Disponibilidade Química de Combustíveis. Análise Estatística de Entropia.",
      "bibliografiaBasica": [
        "BORGNAKKE, C., SONNTAG, R. E. Fundamentos da termodinâmica. 2ª Edição. Editora Blucher, 2018.",
        "MORAN, M.J., SHAPIRO, H.N. Princípios de termodinâmica para engenharia. 8. ed. Rio de Janeiro: LTC, c2018.",
        "COELHO, J.C.M. Energia e Fluidos: Termodinâmica. Vol. 1. Editora Blucher, 2016."
      ],
      "bibliografiaComplementar": [
        "QUADROS, S. A termodinâmica e a invenção das máquinas térmicas. São Paulo: Scipione, 1996.",
        "PERUZZO, J. Experimentos de física básica: termodinâmica, ondulatória e óptica. São Paulo: Livraria da Física, 2012.",
        "MACIEL, E. B. Termodinâmica: fundamentos e aplicações. Editora Intersaberes, 2022.",
        "MORAN, M.J., SHAPIRO, H.N., BOETTNER, D.D., BAILEY, M.B. Princípios de termodinâmica para engenharia. Editora LTC, 2018.",
        "ÇENGEL, Y. A., BOLES, M. A. Termodinâmica. 7ª ed., Porto Alegre, Editora AMGH, 2013."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "TERMO",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ELET0.01",
      "nome": "Eletrônica",
      "ch": "60h",
      "periodo": 4,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [
        "G10CIMA0.01",
        "G10CELE0.01",
        "G10LCEL0.01"
      ],
      "corequisitos": [],
      "ementa": "Introdução à física de semicondutores. Diodos e suas aplicações. Transistores de efeito de campo e transistor bipolar de junção: construção, funcionamento, curvas características, polarização, aplicações básicas e modelos para pequenos e grandes sinais. Amplificador operacional: características básicas, operação em malha aberta e com realimentação, modelos, análise e projeto de circuitos lineares e não lineares com operacionais. Circuitos osciladores.",
      "bibliografiaBasica": [
        "BOYLESTAD, R. L.; NASHELSKY, L. Dispositivos eletrônicos e teoria de circuitos. 11ª ed. São Paulo: Pearson do Brasil, 2013.",
        "SEDRA, A. S.; SMITH, K. C.; CARUSONE, T. C. Circuitos Microeletrônicos. 8ª ed. Rio de Janeiro: LTC, 2013.",
        "SEDRA, A. S.; SMITH, K. C. Microeletrônica. 5ª ed. São Paulo: Pearson do Brasil, 2007."
      ],
      "bibliografiaComplementar": [
        "CIPELLI A. M. V.; SANDRINI W. J. Teoria e desenvolvimento de projetos de circuitos eletrônicos. 23ª ed. São Paulo: Érica, 2001.",
        "JÚNIOR, A. P. Amplificadores operacionais e filtros ativos. 6ª ed. Porto Alegre: Bookman, 2003.",
        "MALVINO, A. P.; BATES, D. J. Eletrônica: Diodos, Transistores e Amplificadores. 7ª ed. Concisa. Porto Alegre: AMGH, 2011.",
        "MARKUS, O. Sistemas analógicos: Circuitos com diodos e transistores. 8ª ed. São Paulo: Érica, 2009.",
        "RAZAVI, B.; SOUZA, J. R. Fundamentos de microeletrônica. 2ª ed. Rio de Janeiro: LTC. 2017."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "ELET",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10LELE0.01",
      "nome": "Laboratório de Eletrônica",
      "ch": "30h",
      "periodo": 4,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [],
      "corequisitos": [
        "G10ELET0.01"
      ],
      "ementa": "Desenvolvimento de montagens relacionadas em laboratório, solução de problemas práticos utilizando conceitos abordados na disciplina teórica relacionada e simulações em computador.",
      "bibliografiaBasica": [
        "BOYLESTAD, R. L.; NASHELSKY, L. Dispositivos eletrônicos e teoria de circuitos. 11ª ed. São Paulo: Pearson do Brasil, 2013.",
        "SEDRA, A. S.; SMITH, K. C.; CARUSONE, T. C. Circuitos Microeletrônicos. 8ª ed. Rio de Janeiro: LTC, 2013.",
        "COMER, D.; COMER, D. Fundamentos de projeto de circuitos eletrônicos. 1ª ed. Rio de Janeiro: LTC, 2005."
      ],
      "bibliografiaComplementar": [
        "CIPELLI A. M. V.; SANDRINI W. J. Teoria e desenvolvimento de projetos de circuitos eletrônicos. 23ª ed. São Paulo: Érica, 2001.",
        "JÚNIOR, A. P. Amplificadores operacionais e filtros ativos. 6ª ed. Porto Alegre: Bookman, 2003.",
        "MALVINO, A. P.; BATES, D. J. Eletrônica: Diodos, Transistores e Amplificadores. 7ª ed. Concisa. Porto Alegre: AMGH, 2011.",
        "MARKUS, O. Sistemas analógicos: Circuitos com diodos e transistores. 8ª ed. São Paulo: Érica, 2009.",
        "RAZAVI, B.; SOUZA, J. R. Fundamentos de microeletrônica. 2ª ed. Rio de Janeiro: LTC, 2017."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LELE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10PRIN1.01",
      "nome": "Projeto Integrador I",
      "ch": "15h",
      "periodo": 4,
      "eixo": "Prática Profissional e Formação Diversificada",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Desenvolvimento da interdisciplinaridade envolvendo os componentes curriculares do quarto período, tendo como base um tema adequado ao curso definido semestralmente. Apresentação do projeto interdisciplinar desenvolvido. Seminários interdisciplinares.",
      "bibliografiaBasica": [
        "GIL, A. C. Como elaborar projetos de pesquisa. 6. ed. São Paulo: Atlas, 2016.",
        "PHILIPPI Jr., A., FERNANDES, V., PACHECO R. C. S. Ensino, pesquisa e inovação: Desenvolvendo a interdisciplinaridade. Manole, 2016.",
        "FAZENDA, I.C.A.; TAVARES, D.E., GODOY, H.P. Interdisciplinaridade na pesquisa científica. Papirus Editora, 2018."
      ],
      "bibliografiaComplementar": [
        "CERVO, A. L.; BERVIAN, P. A.; SILVA, R. Metodologia científica. 6. ed. São Paulo: Pearson Prentice Hall, 2007.",
        "ASSOCIAÇÃO BRASILEIRA DE NORMAS TÉCNICAS. NBR 14724: informação e documentação – trabalhos Acadêmicos - Apresentação. Rio de Janeiro: ABNT, 2011.",
        "KATORI, R. AutoCAD 2015: projetos em 2D. São Paulo: Senac São Paulo, 2015.",
        "RANGEL, Pablo. Sistemas orientados a objetos: teoria e prática com UML e Java. 1. ed. Brasport. 2021.",
        "MONTGOMERY, Douglas C.; RUNGER, George C. Estatística aplicada e probabilidade para engenheiros. 5. ed. Rio de Janeiro: LTC, c2012."
      ],
      "horas": 12,
      "creditos": 1,
      "Sigla": "PI1",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ADFI0.01",
      "nome": "Administração Financeira",
      "ch": "60h",
      "periodo": 5,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10EAEN0.01"
      ],
      "corequisitos": [],
      "ementa": "Introdução às finanças corporativas. Função e estrutura financeira da empresa. Decisões financeiras: de investimento, de financiamento da empresa e distribuição de dividendos. As decisões financeiras e a informação contábil. Administração de capital de giro: Finanças de curto prazo. Análise de lucratividade e risco. Custo e estrutura de Capital.",
      "bibliografiaBasica": [
        "BRIGHAM, E. F.; EHRHARDT, Michael C. Administração financeira: teoria e prática. 3. ed. São Paulo: Cengage Learning, 2016.",
        "ROSS, S. A.; WESTERFIELD. R. W.; JAFFE, J; LAMB, R. Administração Financeira. 10. Ed. São Paulo: AMGH, 2015.",
        "CASAROTTO FILHO, Nélson; KOPITTKE, Bruno Hartmut. Análise de investimentos: matemática financeira, engenharia econômica, tomada de decisão, estratégia empresarial. 11. ed. São Paulo: Atlas, 2010."
      ],
      "bibliografiaComplementar": [
        "ASSAF, Alexandre Neto. Matemática Financeira e suas aplicações. 15. Ed. São Paulo: Atlas, 2019.",
        "MAWKIN, N. G. Introdução à economia. 6. Ed. São Paulo: Cengane Learning, 2014.",
        "SAMANEZ, C. P. Engenharia econômica. São Paulo: Pearson, 2009.",
        "VASCONCELLOS, M. A. S. Economia micro e macro. 6. ed. São Paulo: Atlas, 2015.",
        "BLANK, L.; TARQUIN, A. Engenharia econômica. 6 ed. São Paulo: McGraw-Hill, 2008."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "AFIN",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ISOC0.01",
      "nome": "Introdução a Sociologia",
      "ch": "30h",
      "periodo": 5,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Estudo dos fundamentos da teoria social sobre o mundo do trabalho necessários à compreensão dos fenômenos concernentes às relações de trabalho no capitalismo do século XXI, sob a égide do neoliberalismo, abordando: as metamorfoses do mundo do trabalho e do processo de produção envolvendo a Ciência, a Técnica e a Tecnologia; as novas formas de acumulação do capital nas sociedades contemporâneas; as mutações sociotécnicas e os impactos da globalização nas relações de trabalho; a reestruturação produtiva; a flexibilização e precarização das relações de trabalho e o desemprego; a ideologia do empreendedorismo; a nova sociabilidade do trabalhador e as trajetórias laborais; a divisão do trabalho impactada pelas relações de classe, de gênero, étnico-raciais e geracionais.",
      "bibliografiaBasica": [
        "DAL-ROSSO, Sadi. Mais trabalho!: a intensificação do labor na sociedade contemporânea. São Paulo: Boitempo, 2008.",
        "HARVEY, David. O neoliberalismo: história e implicações. 5. ed. São Paulo: Loyola, 2014.",
        "SOUZA, Marina de Mello e. África e Brasil africano. São Paulo: Ática, 2015."
      ],
      "bibliografiaComplementar": [
        "ANTUNES, Ricardo L. C. Os sentidos do trabalho: ensaio sobre a afirmação e a negação do trabalho. 2. ed. rev. e amp. São Paulo: Boitempo editorial, 2009.",
        "ESCARLATE, Luiz Felipe (consult. técn.). Aprender a empreender. Rio de Janeiro: Fundação Roberto Marinho: Sebrae, 2010.",
        "SANTOS, Sales Augusto dos (org.). Ações afirmativas e combate ao racismo nas Américas. Brasília: SECAD, 2005.",
        "ROCHA, Claudio Jannotti da; Meireles, Edilton. A uberização e a jurisprudência trabalhista estrangeira. Belo Horizonte: Conhecimento Livraria e Distribuidora, 2021.",
        "BARROS, José d'Assunção. Igualdade e diferença: construções históricas e imaginárias em torno da desigualdade humana. Petrópolis: Editora Vozes, 2016."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "ISoc",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10MAEN0.01",
      "nome": "Mecânica Aplicada à Energia",
      "ch": "60h",
      "periodo": 5,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10EDPA0.01",
        "G10FMEC0.01"
      ],
      "corequisitos": [],
      "ementa": "Visão geral de Conceitos de Projeto, Concepção, projeto preliminar, projeto detalhado, análise. Tipos de modelos: Modelos mecânicos, modelos matemáticos, modelos numéricos. Solicitações internas. Reações. Diagramas de esforços. Tensões. Estados de tensão. Equações diferenciais de equilíbrio. Transformação de tensões e de deformações. Critérios de falha. Tensões uniaxiais. Projeto de pinos, colunas. Análise de tensões em treliças. Deformações, definições, relações deformação-deslocamento. Diagramas tensão-deformação, Lei de Hooke generalizada. Deformações axiais em barras e problemas hiperestáticos em barras. Flexão simples plana, oblíqua, seções assimétricas. Cisalhamento em vigas longas. Torção. Solicitações compostas.",
      "bibliografiaBasica": [
        "HIBBELER, R. C. Resistência dos materiais. 7ª. ed. Editora Pearson, 2010.",
        "PINHEIRO, A. C. da F.B e CRIVELARO, M. Fundamentos de resistência dos materiais. Rio de Janeiro, LTC, c2016.",
        "MELCONIAN, S. Mecânica técnica e resistência dos materiais. 20ª. ed. São Paulo, Érica, 2018."
      ],
      "bibliografiaComplementar": [
        "HIBBELER, R. C., Daniel Vieira (Tradutor), Kai Beng Yap, Paulo Roberto Zampieri, (contribuintes). Estática: mecânica para engenharia. 14ª ed., Pearson, 2018.",
        "PORTO, T. B. Mecânica dos sólidos. Belo Horizonte, FUMARC, 2017.",
        "BEER, F.P. Resistência dos materiais: mecânica dos materiais. 4. ed. Porto Alegre, AMGH, 2010.",
        "TIMOSHENKO, S. P. Resistência dos materiais. Rio de Janeiro, LTC, 1981.",
        "SHAMES, I. H. Introdução à mecânica dos sólidos. Rio de Janeiro, Prentice Hall do Brasil, 1983."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "MAE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10EPOT0.01",
      "nome": "Eletrônica de Potência",
      "ch": "90h",
      "periodo": 5,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [
        "G10ELET0.01",
        "G10LELE0.01"
      ],
      "corequisitos": [],
      "ementa": "Características e princípios de operação de dispositivos semicondutores de potência. Tipos de comutação. Retificadores controlados e não controlados. Recortadores (Choppers). Inversores. Circuitos de comando, acionamento e auxílio a comutação e proteção. Cicloconversores. Especificação e projeto de dissipadores. Aplicações em sistemas de energia.",
      "bibliografiaBasica": [
        "AHMED, A. Eletrônica de Potência. 1ª ed. São Paulo: Pearson do Brasil, 2000.",
        "HART, D. W. Eletrônica de potência: análise e projetos de circuitos. 1ª ed. Porto Alegre: Porto Alegre: AMGH, 2011.",
        "MUHAMMAD, H. R. Eletrônica de Potência: Dispositivos, Circuitos e Aplicações. 4ª ed. São Paulo: Pearson do Brasil, 2014."
      ],
      "bibliografiaComplementar": [
        "FRANCHI, C. M. Inversores de frequência: teoria e aplicações. 2ª ed. São Paulo: Érica, 2011.",
        "MARQUES, A. E. B.; CHOUERI, S. J.; CRUZ, E. C. A. Dispositivos Semicondutores: Diodos e Transistores. 13ª ed. São Paulo: Érica, 1998.",
        "MELLO, L. F. P. Projetos de fontes chaveadas: teoria e prática. 1ª ed. São Paulo: Érica, 2011.",
        "SEDRA, A. S.; SMITH, K. C. Microeletrônica. 5ª ed. São Paulo: Pearson do Brasil, 2007.",
        "VOLPIANO, S. L. Eletrônica de potência. 1ª ed. São Paulo: Editora Senai, 2016."
      ],
      "horas": 75,
      "creditos": 6,
      "Sigla": "EPOT",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10LAEN0.01",
      "nome": "Legislação Ambiental e Energética",
      "ch": "30h",
      "periodo": 5,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10IDIR0.01"
      ],
      "corequisitos": [],
      "ementa": "Sistema constitucional brasileiro; noções básicas de direito civil, comercial, administrativo, trabalho e tributário; aspectos relevantes em contratos; regulamentação profissional; fundamentos da propriedade industrial e intelectual. Análise de experiências regulatórias a nível mundial. Legislação energética brasileira. Políticas públicas. Conceito jurídico de meio ambiente. A proteção constitucional do meio ambiente e os bens ambientais. Princípios do Direito Ambiental. Legislação ambiental. Sistema Nacional do Meio Ambiente: organização administrativa e hierarquias. Legislações específicas e correlatas referentes às águas, ao ar, ao solo, à fauna e à flora. A Política Nacional de Recursos Hídricos. Licenciamento ambiental. Medidas jurídicas de proteção ao meio ambiente. Responsabilidade penal por danos ambientais.",
      "bibliografiaBasica": [
        "ANTUNES, P. B. Direito ambiental. 14. ed. São Paulo: Atlas, 2015.",
        "MAZZONI, Clever. Curso básico de direito de energia elétrica. São Paulo, Synergia, 2010.",
        "VIVAN, A. M.; SILVEIRA, R. M. Direito e Energia. São Paulo: Quartier Latin, 2014."
      ],
      "bibliografiaComplementar": [
        "BLANCHET, L. A.; CASTRO, R. P. A. (Coord.). Direito da Energia: economia, regulação e sustentabilidade. Curitiba: Juruá, 2014.",
        "FIORILLO, C. A. P. Curso de Direito Ambiental Brasileiro. 19 ed. São Paulo: Saraiva, 2019.",
        "MACHADO, P. A. L. Direito ambiental brasileiro. 21 ed. São Paulo: Malheiros Editores, 2013.",
        "MILARÉ, É. Direito do Ambiente, a gestão ambiental em foco: doutrina, jurisprudência, glossário. 7. ed. São Paulo: Revista dos Tribunais, 2013.",
        "SAMPAIO, R. S. R. Direito ambiental: doutrina e casos práticos. Rio de Janeiro: Campus Jurídico, 2011."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LegAE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10CMCL0.01",
      "nome": "Climatologia e Mudanças Climáticas",
      "ch": "60h",
      "periodo": 5,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10ENSU0.01"
      ],
      "corequisitos": [],
      "ementa": "Conceitos básicos utilizados no estudo da meteorologia e climatologia; elementos e fatores climáticos; composição e estrutura vertical da atmosfera, radiação solar e balanço de radiação, temperatura do ar, umidade atmosférica, precipitação, pressão atmosférica, circulação e dinâmica atmosférica, tipologias climáticas globais e do Brasil. O sistema climático global. Mudanças e Variabilidades Naturais do Clima. Forçantes externas. Forçantes internas. Modelagem climática. Mudança Climática Pretérita. Cenários do Painel Intergovernamental do Clima (IPCC). Mudanças Climáticas Contemporâneas. Modos de variabilidades climáticas.",
      "bibliografiaBasica": [
        "NOBRE, C.; MARENGO, J. A. (orgs). Mudanças Climáticas em rede: um olhar interdisciplinar. Ed. Canal6, São José dos Campos, SP: INCT, 2017.",
        "BARRY, Roger G.; CHORLEY, Richard. J. Atmosfera, Tempo e Clima. 9. ed. Bookman: Porto Alegre, 2012.",
        "YONUE, R. Y.; AMBRIZZI, T.; REBOITA, M. S.; SILVA, G. A. M. da. Meteorologia: noções básicas. São Paulo: Oficina de Textos, 2017."
      ],
      "bibliografiaComplementar": [
        "BARRY, R. G.; CHORLEY, R. J. Atmosfera, Tempo e Clima. 9. ed. Bookman: Porto Alegre, 2012.",
        "PBMC. Base científica das mudanças climáticas. Volume 1 Primeiro relatório de avaliação nacional. COPPE: Universidade Federal do Rio de Janeiro, Rio de Janeiro, 2014.",
        "MENDONÇA, F.; OLIVEIRA, D. Climatologia: noções básicas e climas do Brasil. São Paulo: Oficina de Textos, 2007.",
        "WMO. Guide to Climatological Practices. N° 100, Geneva: WMO. 2011.",
        "TORRES, F. T. P.; MACHADO, P. J. O. Introdução à climatologia. São Paulo: Cengage Learning, 2011."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "CMC",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10PIEL0.01",
      "nome": "Projetos e Instalações Elétricas",
      "ch": "45h",
      "periodo": 5,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [
        "G10CELE0.01",
        "G10DTAC0.01"
      ],
      "corequisitos": [],
      "ementa": "Iluminação Elétrica: conceitos básicos, metodologia de projetos de iluminação de interiores, viabilidade técnica e econômica. Instalações Elétricas: Carga instalada e demanda. Entrada de energia elétrica em baixa tensão. Proteção contra choques elétricos. Proteção contra sobretensões. Aterramento. Proteção contra descargas atmosféricas. Dimensionamento de condutores. Proteção contra sobrecorrentes. Circuitos de alimentação de motores elétricos.",
      "bibliografiaBasica": [
        "COTRIM, ADEMARO A. M. B. Instalações elétricas. 5 ed. São Paulo: Editora Pearson, c2009.",
        "NISKIER, JULIO. Instalações elétricas. 5. ed. Rio de Janeiro: LTC, 2008.",
        "CREDER, HÉLIO. Instalações elétricas. 15. ed. Rio de Janeiro: LTC, 2007."
      ],
      "bibliografiaComplementar": [
        "ASSOCIAÇÃO BRASILEIRA DE NORMAS TÉCNICAS. NBR 5410: Instalações elétricas de baixa tensão. Rio de Janeiro: ABNT, 2008.",
        "LIMA FILHO, DOMINGOS LEITE. Projetos de instalações elétricas prediais. 12. ed. São Paulo: Editora Érica, 2011.",
        "CAVALIN, GERALDO; CERVELIN, SEVERINO. Instalações elétricas prediais. 21. ed. São Paulo: Érica, 2017.",
        "MAMEDE FILHO, JOÃO. Instalações elétricas industriais. 8. ed. Rio de Janeiro: LTC, c2010.",
        "NISKIER, JULIO. Instalações elétricas. 2. ed. Rio de Janeiro: Guanabara Koogan, 1992."
      ],
      "horas": 37,
      "creditos": 3,
      "Sigla": "P&IE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ELER0.01",
      "nome": "Eletromagnetismo",
      "ch": "60h",
      "periodo": 5,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [
        "G10EDPA0.01",
        "G10FELE0.01"
      ],
      "corequisitos": [],
      "ementa": "Equações de Maxwell e suas aplicações: breve histórico; correntes de condução e de deslocamento; formas diferencial e integral, passagem da forma diferencial para integral e vice-versa; representações nos domínios do tempo e da frequência (fasorial ou complexo); definições generalizadas de condutores e isolantes (tangente de perdas); potenciais de Lorentz; efeitos pelicular e de proximidade; aplicações em eletrostática (soluções das Equações de Poisson e de Laplace e problemas de fronteira, capacitâncias de geometrias complexas), magnestostática (materiais ferromagnéticos, circuitos magnéticos, indutâncias de geometrias complexas) e quase-estática (variação temporal lenta, indutância mútua e auto-indutância, transformador, gerador, motor, correntes parasitas, histerese dielétrica, relações de fronteira); relação entre a Teoria de Circuito e a de Campo.",
      "bibliografiaBasica": [
        "BRANISLAV M. NOTAROS. Eletromagnetismo. Editora Pearson, 2011.",
        "CLAUDIO ELIAS DA SILVA, Arnaldo José Santiago; Alan Freitas Machado e Altair Souza de Assis. Eletromagnetismo: fundamentos e simulações. Editora Pearson, 2014.",
        "TELLES, Dirceu DAlkmin (Organizador); Mongelli Netto, João (Organizador). Física com aplicação tecnológica eletrostática, eletricidade, eletromagnetismo e fenômenos de superfície. Editora Blucher, 2016."
      ],
      "bibliografiaComplementar": [
        "ALVARENGA, Beatriz Gonçalves de; LUZ, Antônio Máximo Ribeiro da. Curso de física. São Paulo: Harbra, 1979. 3v.",
        "AIRTON RAMOS. Eletromagnetismo. Editora Blucher, 2016.",
        "YOUNG, Hugh D.; Freedman, Roger A. Física III: eletromagnetismo - 12ª edição. Editora Pearson, 2008.",
        "DIOVANA DE MELLO LALIS. Introdução ao eletromagnetismo. Editora Intersaberes, 2021.",
        "IVAN DE OLIVEIRA. Introdução ao eletromagnetismo. Editora Blucher, 2021."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "EMAG",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10IESE0.01",
      "nome": "Introdução à Engenharia de Segurança",
      "ch": "30h",
      "periodo": 6,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Prevenção de riscos nas atividades de trabalho com vistas à defesa da integridade das pessoas. Políticas prevencionistas e normas regulamentadoras. Programas de Segurança do Trabalho. Sistemas de proteção administrativo, coletivo e individual. Legislação Acidentária. Segurança Contra Incêndio e Pânico.",
      "bibliografiaBasica": [
        "FERREIRA FILHO, Fernando Guedes (coord.). Segurança e saúde na indústria da construção: prevenção e inovação. Brasília: CВІС, 2019.",
        "HEMÉRITAS, Adhemar Batista. Organização e normas. 5. ed. São Paulo: Atlas, 1991.",
        "HOEPPNER, Marcos Garcia (org.). NR: Normas regulamentadoras relativas à segurança e saúde no trabalho (Capítulo V. Título II, da CLT): NR-1 à NR-36. 6. ed. São Paulo: Ícone, 2015."
      ],
      "bibliografiaComplementar": [
        "CIENFUEGOS, Freddy. Segurança no laboratório. Rio de Janeiro: Interciência, 2001.",
        "DE CICCO, Francesco M.G.A.F. Introdução à engenharia de segurança de sistemas. 2. ed. São Paulo: FUNDACENTRO, 1981.",
        "KROEMER, K. H. E. Manual de ergonomia: adaptando o trabalho ao homem. 5. ed. Porto Alegre: Bookman, 2005.",
        "EQUIPE ATLAS. Segurança e medicina do trabalho. 75. ed. São Paulo: Atlas, 2015.",
        "SENAI. Regras de segurança (mecânica). Rio de Janeiro: Senai, 1962."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "IES",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10FTRA0.02",
      "nome": "Fenômenos de Transporte",
      "ch": "90h",
      "periodo": 6,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10FOFT0.01"
      ],
      "corequisitos": [],
      "ementa": "Conceitos Básicos: Viscosidade, Pressão, Temperatura, Tensão Superficial. Fluido Newtoniano e não Newtoniano. Camada Limite. Equação Fundamental da Fluido-Estática. Princípios da Manometria. Empuxo Hidrostático. Esforços sobre Corpos Submersos. Fluidos em Movimento. Derivada Particular. Equação de Conservação para Volume de Controle Teorema de Transporte de Reynolds. Conservação da Massa. Equação da Quantidade de Movimento, na Forma Integral. Equação de Euler. Equação de Bernoulli. Tubo de Pitot e Venturi. Escoamento de Fluido Viscoso. Perda de Carga em Tubos e Dutos. Perdas Distribuídas e Perdas Localizadas. Diagrama de Moody. Condução Térmica Através de Paredes Planas. Analogia Elétrica. Condução Térmica através de Paredes Curvas e Compostas. Convecção Térmica sobre Placas Planas. Convecção Térmica para Escoamentos Laminares e Turbulentos, em Tubos e Dutos. Correlações Empíricas. Radiação Térmica.",
      "bibliografiaBasica": [
        "FOX, R.W.; MCDONALD, A. T. Introdução à mecânica dos fluidos. 8ª. ed. Rio de Janeiro: LTC, c2014.",
        "BERGMAN, T. L., LAVINE, A. S., INCROPERA, F. P.; DE WITT, D. P. Fundamentos de transferência de calor e massa. 7ª. ed. Rio de Janeiro: LTC, c2014.",
        "BRUNETTI, F. Mecânica dos fluidos. 2ª ed. São Paulo: Pearson, 2008."
      ],
      "bibliografiaComplementar": [
        "BIRD, R. B.; STEWART, W. E.; LIGHTFOOT, E. N. Fenômenos de transporte. 2ª. ed. Rio de Janeiro: LTC, 2004.",
        "ÇENGEL, Y. A.; CIMBALA, J. M. Mecânica dos fluidos: fundamentos e aplicações. 3ª. ed. São Paulo: McGraw-Hill, 2015.",
        "MUNSON, B. R.; YOUNG, D. F.; OKIISHI, T. H. Fundamentos da mecânica dos fluidos. São Paulo: Edgard Blucher, 1997. v. 2.",
        "POTTER, M. C.; WIGGERT, D. C.; HONDZO, M. Mecânica dos fluidos. São Paulo: Pioneira, 2004.",
        "SCHIMIDT, F.W.; HENDERSON, R. E.; WOLGEMUTH, C. H. Introdução às ciências térmicas: termodinâmica, mecânica dos fluidos e transferência de calor. São Paulo: Edgard Blucher, 1996."
      ],
      "horas": 75,
      "creditos": 6,
      "Sigla": "FT",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10PEPR0.01",
      "nome": "Planejamento Energético e Prospecção",
      "ch": "45h",
      "periodo": 6,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10LAEN0.01"
      ],
      "corequisitos": [],
      "ementa": "Princípios de planejamento e operação do sistema elétrico. Uso de energia nos setores: energético, residencial, comercial, público, agropecuário, transportes e industrial. Balanço de energia útil. Modelos de otimização do suprimento energético. Matrizes insumo-produto. Financiamento do setor energético. Políticas tarifárias, de preços e análise de riscos. Planos Decenais e Plano 2050.",
      "bibliografiaBasica": [
        "GIACOBBO, D. G. et. al. Segurança e Transição Energética. Editora Synergia, 2022.",
        "REIS, L. B. dos. Matrizes energéticas: Conceitos e Usos em Gestão e Planejamento - Série Sustentabilidade. Barueri: Manole, 2011.",
        "OLÍMPIO, A., et. al Planejamento Energético: Inserção Da Variável Ambiental na Expansão da Oferta de Energia Elétrica. Editora Synergia, 1ª ed., 2019."
      ],
      "bibliografiaComplementar": [
        "REIS, L. B. dos; FADIGAS, E. A. F. A.; CARVALHO, C. E. Energia, recursos naturais e a prática do desenvolvimento sustentável. 3ª. ed. rev. E atual. Barueri: Manole, 2019.",
        "REIS, L. B. dos. Geração de energia elétrica. 3. ed. Barueri: Manole, 2017.",
        "SILVA, A. L. R. da, RAMOS, D. S. Expansão da Capacidade do Atendimento de Ponta do Sistema Interligado Brasileiro. Editora Synergia, 1ª ed., 2022.",
        "BRAGA, R. B. Setor Elétrico Brasileiro. Visão crítica da geração de energia. D'placido, 2016.",
        "FERREIRA, B., GEDRA, R. Gerenciamento de Energia: Ações Administrativas e técnicas de uso adequado da energia elétrica. Editora Érica, 3ª ed., 2020."
      ],
      "horas": 37,
      "creditos": 3,
      "Sigla": "PEP",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10EAEE0.01",
      "nome": "Economia Aplicada à Energia",
      "ch": "30h",
      "periodo": 6,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10ADFI0.01"
      ],
      "corequisitos": [],
      "ementa": "Economia: Microeconomia e macroeconomia. Microeconomia fundamentos: análise da demanda, da oferta e o equilíbrio de mercado; Elasticidades; custos de produção; estruturas de mercado; Fundamentação teórica da economia neoclássica e alternativa que sustentam a política energética. Energia, produto e formação de capital; Balanço Energético; Energia e monopólios naturais e oligopólios: caso do setor de petróleo, gás natural, elétrico e outros energéticos; as relações internacionais no domínio da energia.",
      "bibliografiaBasica": [
        "SALDANHA, B. L. F. Engenharia econômica: projetos de investimento. Rio de Janeiro: Publicação Independente, 2020.",
        "QUEIROZ, H. Economia da Energia Fundamentos Econômicos, Evolução Histórica e Organização Industrial. GEN LTC, 2ed, 2016.",
        "TEBCHIRANI, F. R. Princípios de economia: micro e macro. Editora Intersaberes, 2012."
      ],
      "bibliografiaComplementar": [
        "RICKLEFS, R. E. A economia da natureza. 6. ed. Rio de Janeiro, Guanabara Koogan, c2010.",
        "VASCONCELLOS, M.A.S. de. Economia: micro e macro. São Paulo, Atlas, 2015.",
        "FONTES, ROSA. Economia: um enfoque básico e simplificado. São Paulo: Atlas, 2010.",
        "PINTO Jr., H. Q.; ALMEIDA, E. F. Economia da Energia: Fundamentos Econômicos, Evolução Histórica e Organização Industrial. Editora Campus, 2007.",
        "ZWEIFEL, P., PRAKTIKNJO, A., ERDMANN, G. Energy Economics: Theory and Applications. 1a ed., Springer, 2017."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "EAE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ESOL0.01",
      "nome": "Energia Solar",
      "ch": "60h",
      "periodo": 6,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10CELE0.01",
        "G10LCEL0.01",
        "G10CMCL0.01"
      ],
      "corequisitos": [
        "G10EPOT0.01"
      ],
      "ementa": "Energia solar. Métodos de conversão. O espectro solar. Atmosfera. Tecnologia das células solares. Solarimetria Painéis solares. Parâmetros ópticos e térmicos. Sistemas fotovoltaicos. Sistemas de aquecimento. Conversores CC/CC e CC/CA. Dimensionamento de sistemas conectados à rede e isolado. Projeto auxiliado por computador.",
      "bibliografiaBasica": [
        "ALDABO, R. Energia Solar para produção de Eletricidade. Editora ArtLiber. 1 ed, 2012.",
        "KALOGIROU, S. A., Solar Energy Engineering: Processes and Systems, Academic Press, 3ed., 2023.",
        "WOLFGANG PALZ. Energia Solar e Fontes Alternativas. Editora HEMUS. 2002."
      ],
      "bibliografiaComplementar": [
        "ALDABO, R. Energia Solar. Editora ArtLiber. 2002.",
        "BEZERRA, A.M. Energia Solar- aquecedores de água. Curitiba-PR: Editora LITEL, 19.",
        "COMETTA, E. Energia Solar- utilização e empregos práticos. Editora Hemus, 19.",
        "SARAIVA, J.D.L. Energia Solar para Aquecimento de Água. Viçosa-MG: CPT, 2001.",
        "WALISIEWICZ. Energia Alternativa: Solar, Eólica, Hidrelétrica e de Biocombustíveis. Editora Publifolha. 1ª edição, 2008."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "ESOL",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10HAPI0.01",
      "nome": "Hidrologia Aplicada",
      "ch": "30h",
      "periodo": 6,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10CMCL0.01"
      ],
      "corequisitos": [],
      "ementa": "Ciclo hidrológico; balanço hídrico e equação hidrológica; características físicas das bacias hidrográficas e elementos fisiográficos; elementos de estatística e probabilidades aplicados à hidrologia: modelos empíricos, teóricos e populacionais; estimação de parâmetros; escoamento superficial: vazões máximas e mínimas, hidrograma unitário, hidrograma unitário sintético e modelos chuva-vazão; reservatórios: elementos, amortecimento de cheias, dimensionamento, operação. Geração de energia em reservatórios.",
      "bibliografiaBasica": [
        "GARCEZ, L. N.; ALVAREZ G. A. Hidrologia. 2a. ed. São Paulo: Edgard Blucher, 1988.",
        "GRIBBIN, J. E. Introdução à hidráulica, hidrologia e gestão de águas pluviais. Tradução: Damas, G, P. São Paulo: Cencage Learning, 2009.",
        "PINTO N. L. S. et. al. Hidrologia básica. São Paulo: Blucher, 1976."
      ],
      "bibliografiaComplementar": [
        "MOTA S. Preservação de recursos hídricos. Rio de Janeiro: ABES, 1988.",
        "NAGHETTINI, M; PINTO, É. A. Hidrologia estatística. Belo Horizonte, CPRM, 2007.",
        "REBOUÇAS A.C.; BRAGA B.; TUNDISI J.G. Águas doces no Brasil: capital ecológico, uso e conservação. 3. ed., rev. e ampl. São Paulo: Escrituras, 2006.",
        "RIGHETTO, A. M. Hidrologia e recursos hídricos. São Paulo: EESC-USP, 1998.",
        "TUCCI, E. M. Hidrologia ciência e aplicação. 4a. ed. Porto Alegre: Editora da Universidade-ABRH, 2007."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "HidrA",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10CGEN0.01",
      "nome": "Conversão e Geração de Energia",
      "ch": "60h",
      "periodo": 6,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [
        "G10ELER0.01"
      ],
      "corequisitos": [
        "G10FTRA0.02"
      ],
      "ementa": "Princípios de conversão eletromecânica da energia. Transformadores monofásicos; cálculo dos parâmetros elétricos e magnéticos; auto-transformador; transformador de três enrolamentos; transformador trifásico; máquinas rotativas: conceitos básicos, princípios de funcionamento, conjugado eletromagnético; ensaios; máquinas de corrente contínua: tecnologia, tensões e funcionamento do comutador, relações de velocidade e conjugado das máquinas derivação, série, composta e excitação independente.",
      "bibliografiaBasica": [
        "BIM, EDSON; Máquinas Elétricas e Acionamento. 2. ed. Rio de Janeiro, Campus, Elsevier, 2012.",
        "DEL TORO, VINCENT. Fundamentos de máquinas elétricas. Rio de Janeiro, LTC, 2011.",
        "MARTIGNONI, ALFONSO. Máquinas Síncronas, São Paulo, Edart, 1967."
      ],
      "bibliografiaComplementar": [
        "SEN, P.C.; Principles of Electric Machines and Power Electronics, 2nd Edition, John Wiley & Sons, 1997.",
        "CHAPMAN, S. Electric Machinery Fundamentals. Mcgraw Hill Higher Education; 5th edition (2011).",
        "FITZGERALD, A.E.; KINGSLEY Jr., C. & UMANS, S.D. Máquinas Elétricas. 6ª Edição. Porto Alegre, Bookman, 2006.",
        "SLEMON, G. R., Electric Machines and Drives. Addison-Wesley Publishing Company, Inc. New York, 1992.",
        "LEONHARD, W., Control of electrical drives, 3rd edition, Springer, Berlin, 2001."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "CGE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10LCGE0.01",
      "nome": "Laboratório de Conversão e Geração de Energia",
      "ch": "30h",
      "periodo": 6,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [],
      "corequisitos": [
        "G10CGEN0.01"
      ],
      "ementa": "Ensaios de rotina: transformadores, máquinas rotativas e máquinas de corrente contínua.",
      "bibliografiaBasica": [
        "BIM, EDSON; Máquinas Elétricas e Acionamento. 2. ed. Rio de Janeiro, Campus, Elsevier, 2012.",
        "DEL TORO, VINCENT. Fundamentos de máquinas elétricas. Rio de Janeiro, LTC, 2011.",
        "MARTIGNONI, ALFONSO. Máquinas Síncronas, São Paulo, Edart, 1967."
      ],
      "bibliografiaComplementar": [
        "SEN, P.C.; Principles of Electric Machines and Power Electronics, 2nd Edition, John Wiley & Sons, 1997.",
        "CHAPMAN, S. Electric Machinery Fundamentals. Mcgraw Hill Higher Education; 5th edition (2011).",
        "FITZGERALD, A.E.; KINGSLEY Jr., C. & UMANS, S.D. Máquinas Elétricas. 6ª Edição. Porto Alegre, Bookman, 2006.",
        "SLEMON, G. R., Electric Machines and Drives. Addison-Wesley Publishing Company, Inc. New York, 1992.",
        "LEONHARD, W., Control of electrical drives, 3rd edition, Springer, Berlin, 2001."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LCGE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10MCIE0.01",
      "nome": "Metodologia Científica",
      "ch": "30h",
      "periodo": 6,
      "eixo": "Prática Profissional e Formação Diversificada",
      "prerequisitos": [
        "G10IINS1.01"
      ],
      "corequisitos": [],
      "ementa": "Conceito de ciência; pesquisa em ciência e tecnologia; tipos de conhecimento; epistemologia das ciências; métodos de pesquisa; a produção de pesquisa científica.",
      "bibliografiaBasica": [
        "FRANÇA, J. L. Manual de normalização de publicações técnico- científicas. 8. ed. Belo Horizonte: Ed. UFMG, 2007.",
        "LAKATOS, E. M.; MARCONI, M. A. Metodologia científica. 8. ed. São Paulo: Atlas, 2022.",
        "LAKATOS, E. M.; MARCONI, M. A. Técnicas de pesquisa: planejamento e execução de pesquisas, amostragens e técnicas de pesquisa, elaboração, análise e interpretação de dados. 9. ed. São Paulo: Atlas, 2021."
      ],
      "bibliografiaComplementar": [
        "CERVO, Amado Luiz; BERVIAN, Pedro Alcino; SILVA, Roberto da. Metodologia científica. 6. ed. São Paulo: Prentice-Hall, 2007.",
        "DEMO, P. Metodologia científica em ciências sociais. 3. ed. São Paulo: Atlas, 2000.",
        "OLIVEIRA, Silvio Luiz de. Tratado de metodologia científica: projetos de pesquisas, TGI, PFC, monografias, dissertações e teses. 2. ed. São Paulo: Pioneira, c1999.",
        "SEVERINO, A. J. Metodologia do trabalho científico. 23. ed. São Paulo: Cortez, 2007.",
        "TAKAHASHI, Ricardo H. C. A estrutura do conhecimento tecnológico do tipo científico. Belo Horizonte: Editora UFMG, 2009."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "MC",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10GEMP0.01",
      "nome": "Gestão Empreendedora",
      "ch": "60h",
      "periodo": 7,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10ADFI0.01"
      ],
      "corequisitos": [],
      "ementa": "Noções de empreendedorismo. Perfil do empreendedor e características empreendedoras. Características e etapas de um projeto. Modelo de negócios. Estrutura de um plano de negócios. Estudo dos métodos de gestão, incluindo as ferramentas da qualidade e sua implementação.",
      "bibliografiaBasica": [
        "BERNARDI, L. A. Manual de empreendedorismo e gestão: fundamentos, estratégias e dinâmicas. 2. ed. São Paulo: Atlas, 2012.",
        "SOUZA, Stefano Nunes Portuguez de (Coord.). Como elaborar um plano de negócios. Brasília: Sebrae, 2013.",
        "SEBRAE. Gestão de pessoas e equipe: guia do educador. Brasília, DF: Sebrae, 2013."
      ],
      "bibliografiaComplementar": [
        "MARSHALL JUNIOR, Isnard. Gestão da qualidade. 10. ed. Rio de Janeiro: FGV, 2010.",
        "PEREIRA, Nixon Diniz. Boas ideias: as chaves para a inovação em negócios e startups. Erechim: Deviant, 2017.",
        "CERTO, S. C; PETER, J. P.; MARCONDES, R. C.; CESAR, A. M. R. Administração Estratégica: planejamento e Implantação de Estratégias. 3. ed. São Paulo: Pearson, 2010.",
        "ESCARLATE, Luiz Felipe (consult. técn.). Aprender a empreender. Rio de Janeiro: Fundação Roberto Marinho: Sebrae, 2010.",
        "ΜΑΧΙΜΙΑΝΟ, Antonio Cesar Amaru. Administração para empreendedores: fundamentos da criação e da gestão de novos negócios. São Paulo: Pearson Prentice Hall, 2006."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "GE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ETER0.01",
      "nome": "Energia Térmica",
      "ch": "60h",
      "periodo": 7,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10TERM0.01"
      ],
      "corequisitos": [],
      "ementa": "Fundamentos de ciências térmicas; Avaliação de equipamentos e sistemas de conversão de energia térmica. Estudo de ciclos térmicos eficientes. Tecnologia de combustão. Eficiência em processos de combustão. Projetos de aproveitamento eficiente da energia em equipamentos e processos industriais. Aplicação de ferramentas de integração energética de processos e sistemas de utilidades. Desenvolvimento de estudo de casos de integração energética.",
      "bibliografiaBasica": [
        "LORA, E. E. S.; NASCIMENTO., M. A. R. Geração Termelétrica Planejamento, Projeto e Operação - vol. 1 e vol. 2. 1ª ed. Editora Interciência, 2004.",
        "SANTOS, N. O. Termodinâmica aplicada às termelétricas: teoria e prática. Rio de Janeiro: Interciência, 2000.",
        "TANUMA, T. Advances in Steam Turbines for Modern Power Plants, 2ed., 2022. Woodhead Publishing."
      ],
      "bibliografiaComplementar": [
        "MAZURENKO, A. S., SOUZA, Z. de, LORA, E. E. S. Máquinas Térmicas de Fluxos: Cálculos Termodinâmicos e Estruturais. Editora Interciência, 2013.",
        "FILIPPO F., G. E. Máquinas Térmicas Estáticas e Dinâmicas. Editora Ética, 1ª ed., 2014.",
        "CLEMENTINO, L. D. A Conservação de Energia por meio da Cogeração de Energia Elétrica. São Paulo: Editora Érica, 2001.",
        "BEITH, R. Small and Micro Combined Heat and Power (CHP) Systems: Advanced Design, Performance, Materials and Applications (Woodhead Publishing Series in Energy Book 18), English Edition, 1ª Edição, 2011.",
        "SOUZA, Z. de. Plantas de geração térmica a gás: turbina a gás turbocompressor recuperador de calor - câmara de combustão. Editora Interciência, 2014."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "ETerm",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10FCOM0.01",
      "nome": "Fundamentos de Controle",
      "ch": "60h",
      "periodo": 7,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [
        "G10CFVV2.01",
        "G10CELE0.01",
        "G10LCEL0.01"
      ],
      "corequisitos": [],
      "ementa": "Fundamentos de sistemas de controle. Modelagem matemática de sistemas dinâmicos. Linearização. Função de transferência. Resposta dinâmica de sistemas lineares. Análise de sistemas por diagramas de blocos. Estabilidade. Projetos de sistemas de controle com realimentação. Ações de controle básicas. Resposta de frequência. Critérios de estabilidade e lugar das raízes. Análise no espaço de estados.",
      "bibliografiaBasica": [
        "DORF, R. C.; BISHOP, R. H. Sistemas de Controle Modernos. 13ª ed. Rio de Janeiro: LTC, 2018.",
        "NISE, N. S. Engenharia de sistemas de controle. 7ª ed. Rio de Janeiro: LTC, 2017.",
        "OGATA, K. Engenharia de controle moderno. 5ª ed. São Paulo: Pearson do Brasil, 2010."
      ],
      "bibliografiaComplementar": [
        "BOLTON, W. Engenharia de controle. 1ª ed. São Paulo: Makron, 1995.",
        "CHEN, C.T. Linear System Theory and Design. 4ª ed. Oxford: Oxford University Press USA, 2023.",
        "FRANKLIN, G.; POWELL, J.D.; Emami-NAIENI, A. Sistemas de Controle para Engenharia. 6ª ed. Porto Alegre: Bookman, 2023.",
        "GOLNARAGHI, F.; KUO, B. Sistemas de Controle Automático. 9ª ed. Rio de Janeiro: LTC, 2012.",
        "LATHI, B. P. Sinais e Sistemas Lineares. 2ª ed. Porto Alegre: Bookman, 2007."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "FCtrl",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10SEMB0.01",
      "nome": "Sistemas Embarcados",
      "ch": "60h",
      "periodo": 7,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [
        "G10ELET0.01",
        "G10LELE0.01",
        "G10LPCO2.01",
        "G10PRCO2.01"
      ],
      "corequisitos": [],
      "ementa": "Interfaceamento AD/DA. Projetos usando conversores A/D e D/A com microcontroladores. Microcontroladores: projetos com PIC. Sistemas embarcados. Microprocessadores: Microarquitetura e microinstruções. Nível de arquitetura do conjunto de instruções. Projetos de aplicações com microprocessadores e microcontroladores. Interfaces de E/S. Dispositivos periféricos.",
      "bibliografiaBasica": [
        "ALMEIDA, R. M. A.; MORAES, C. H. V. Programação de Sistemas Embarcados. 2ª ed. Rio de Janeiro: LTC, 2022.",
        "BACKES, A. Linguagem C: Completa e Descomplicada. 2ª ed. Rio de Janeiro: LTC, 2018.",
        "PEREIRA, F. Microcontroladores PIC: Programação em C. 7ª ed. São Paulo: Érica, 2009."
      ],
      "bibliografiaComplementar": [
        "MIYADAIRA, A. N. Microcontroladores PIC18. 4ª ed. São Paulo: Érica, 2013.",
        "OLIVEIRA, A. S.; ANDRADE, F. S. Sistemas Embarcados: Hardware e Firmware Na Pratica. 2ª ed. São Paulo: Érica, 2009.",
        "SOUZA, D. J. Desbravando o PIC: Ampliado e Atualizado para PIC 16F628A. 12ª ed. São Paulo: Érica, 2003.",
        "ZHIRKOV, I. Programação em Baixo Nível: C, Assembly e Execução de Programas na Arquitetura Intel 64. 1ª ed. Novatec, 2018.",
        "IDEALI, W. Conectividade Em Automação E IoT: Protocolos I2C, SPI, USB, TCP-IP entre outros. 1a ed. Alta Books, 2021."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "SEmb",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10EEOL0.01",
      "nome": "Energia Eólica",
      "ch": "60h",
      "periodo": 7,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10FTRA0.02",
        "G10CGEN0.01",
        "G10LCGE0.01",
        "G10EPOT0.01",
        "G10CMCL0.01"
      ],
      "corequisitos": [],
      "ementa": "O potencial da energia eólica no mundo e no Brasil. As características dos ventos. Fundamentos da geração eólica: relação entre velocidade e potência; potência extraída do vento, processo de conversão, aspectos aerodinâmicos, eficiência teórica de Betz; curva de potência das turbinas e fator de capacidade. Classificação das máquinas eólicas: tipos de aerogeradores; acionamentos de geradores; sistemas desconectados do sistema de potência; sistemas conectados ao sistema de potência; sistemas de regulação e controles.",
      "bibliografiaBasica": [
        "ALDABO, Ricardo. Energia Eólica. 1. ed. São Paulo: ArtLiber, 2003.",
        "LETCHER, T. Wind Energy Engineering: A Handbook for Onshore and Offshore Wind Turbines. 2ed, 2023.",
        "ROSAS, P. A.C., ESTANQUEIRO, A. I. Guia de Projetos Elétricos de Centrais Eólicas. Centro Brasileiro de Energia Eólica. 2003."
      ],
      "bibliografiaComplementar": [
        "WALISIEWICZ. Energia Alternativa: Solar, Eólica, Hidrelétrica e de Biocombustíveis. Editora Publifolha.",
        "FARRET, F. A. Renewable energy systems. Ed. 1. CRC Press. 2004.",
        "ACKERMANN, THOMAS. Wind Power in Power System Vol. II, John Wiley and Sons, 2005.",
        "PYRHONEN, J. Design of Rotating Electrical Machines, John Willey and Sons Ltd, First Edition, 2008.",
        "Siegfried HEIER and Rachel WADDINGTON. Grid Integration of Wind Energy Conversion Systems 2006, 2nd Edition John Willey and Sons Ltd."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "EEO",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10SETE0.01",
      "nome": "Sistemas Elétricos e Transmissão de Energia",
      "ch": "60h",
      "periodo": 7,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [
        "G10PIEL0.01",
        "G10CGEN0.01"
      ],
      "corequisitos": [],
      "ementa": "Modelagem de elementos de sistemas elétricos para análise no domínio da frequência (linha de transmissão, transformador e gerador). Sistema por unidade. Componentes simétricos. Cálculo de curtos-circuitos desequilibrados. Estudos de Fluxo de potência. Transmissão de energia elétrica. Características mecânicas e elétricas. Cabos. Isoladores. Ferragens. Estruturas. Transmissão em CA. Potência transmitida. Perdas. Transitórios. Efeitos especiais. Limite térmico. Transmissão em CC. Linhas de transmissão de potência.",
      "bibliografiaBasica": [
        "MAMEDE FILHO, João; MAMEDE, Daniel Ribeiro. Proteção de sistemas elétricos de potência. Rio de Janeiro: LTC, 2011.",
        "BAYLISS, C., HARDY, B. Transmission and Distribution Electrical Engineering, Third Edition, Newnes, 2007.",
        "NISKIER, Julio; MACINTYRE, Archibald Joseph. Instalações elétricas. 5. ed. Rio de Janeiro: LTC, 2008."
      ],
      "bibliografiaComplementar": [
        "STEVENSON JÚNIOR, William D. Elementos de análise de sistemas de potência. São Paulo: McGraw-Hill, c1974.",
        "CAMINHA, Proteção de sistemas elétricos. 2. ed. Rio de Janeiro: Interciência, 2005.",
        "O'MALLEY, John R. Análise de circuitos. Tradução de Moema Sant' Anna Belo. 2. ed. São Paulo: Makron Books, 1993. (Coleção Schaum).",
        "PRISCILA ERTMANN BOLZAN. Análise de circuitos elétricos. Contentus, 2020.",
        "EDUARDO DA SILVA. Equipamentos elétricos. Contentus, 2020."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "SETE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10PINT2.01",
      "nome": "Projeto Integrador II",
      "ch": "15h",
      "periodo": 7,
      "eixo": "Prática Profissional e Formação Diversificada",
      "prerequisitos": [
        "G10PRIN1.01"
      ],
      "corequisitos": [],
      "ementa": "Desenvolvimento da interdisciplinaridade envolvendo os componentes curriculares do sétimo período, tendo como base um tema adequado ao curso definido semestralmente. Apresentação do projeto interdisciplinar desenvolvido. Seminários interdisciplinares.",
      "bibliografiaBasica": [
        "GIL, A. C. Como elaborar projetos de pesquisa. 6. ed. São Paulo: Atlas, 2016.",
        "PHILIPPI Jr., A., FERNANDES, V., PACHECO R. C. S. Ensino, pesquisa e inovação: Desenvolvendo a interdisciplinaridade. Manole, 2016.",
        "FAZENDA, I.C.A.; TAVARES, D.E., GODOY, H.P. Interdisciplinaridade na pesquisa científica. Papirus Editora, 2018."
      ],
      "bibliografiaComplementar": [
        "CERVO, A. L.; BERVIAN, P. A.; SILVA, R. Metodologia científica. 6. ed. São Paulo: Pearson Prentice Hall, 2007.",
        "BALFOUR, John; SHAW, Michael; NASH, Nicole Bremer. Introdução ao projeto de sistemas fotovoltaicos. Rio de Janeiro: LTC, 2016.",
        "ASSOCIAÇÃO BRASILEIRA DE NORMAS TÉCNICAS. NBR 5410: Instalações elétricas de baixa tensão. Rio de Janeiro: ABNT, 2008.",
        "BERNARDI, L. A. Manual de empreendedorismo e gestão: fundamentos, estratégias e dinâmicas. 2. ed. São Paulo: Atlas, 2012.",
        "ASSOCIAÇÃO BRASILEIRA DE NORMAS TÉCNICAS. NBR 14724: informação e documentação – trabalhos Acadêmicos - Apresentação. Rio de Janeiro: ABNT, 2011."
      ],
      "horas": 12,
      "creditos": 1,
      "Sigla": "PI2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10GPEN0.01",
      "nome": "Gestão de Projetos em Engenharia",
      "ch": "60h",
      "periodo": 8,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10IESE0.01",
        "G10GEMP0.01"
      ],
      "corequisitos": [],
      "ementa": "Conceitos de Projetos; Classificação: programa, projetos e portfólio. Áreas de conhecimento da gerência de projetos: Escopo, Tempo, Risco, Integração, Comunicação, Custo, Recursos Humanos, Aquisição, Qualidade. Grupos de processos: Iniciação, Planejamento, Execução, Controle, Encerramento. Técnicas de acompanhamento de projetos. Ferramentas computacionais de apoio ao planejamento e gerência de projetos: MS Project, WBS Chart e Pert Expert. Estudo de casos.",
      "bibliografiaBasica": [
        "KERZNER, Harold. Gestão de projetos: as melhores práticas. 4. ed. Porto Alegre: Bookman, 2020.",
        "PROJECT MANAGEMENT INSTITUTE. Um guia de conhecimentos em gerenciamento de projetos (Guia PMBOK). 5. ed., Project Management Institute, Inc., Pennsylvania, 2017.",
        "VALERIANO, Dalton L. Moderno gerenciamento de projetos. Pearson Prentice Hall, 2015."
      ],
      "bibliografiaComplementar": [
        "GIDO, J.; CLEMENTIS, J. P. Gestão de projetos. Cengage: São Paulo, 2018.",
        "MATHIAS, W. F.; WOILER, S. Projeto: planejamento, elaboração e análise. 2. ed. São Paulo: Atlas, 2008.",
        "ΜΑΧΙΜΙΑΝΟ, A. C. A. Administração de projetos: como transformar ideias em resultados. 4. Ed. São Paulo: Atlas, 2010.",
        "MENEZES, L. C. Gestão de projetos. 4. ed. São Paulo: Atlas 2018.",
        "VARGAS, Ricardo V. Manual prático do plano de projeto: utilizando o PMBOK guide. 6. ed. Rio de Janeiro: Brasport, 2018."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "GPE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10FTEC0.01",
      "nome": "Filosofia da Tecnologia",
      "ch": "30h",
      "periodo": 8,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Estudo dos fundamentos filosóficos necessários à compreensão da tecnologia, tratando de questões ontológicas, epistemológicas, estéticas, éticas e políticas, abordando: a distinção entre o natural e o artificial, bem como o lugar ocupado pela produção técnica/tecnológica entre as áreas do conhecimento; o domínio humano da natureza por meio dos saberes técnicos e científicos e suas consequências; a relação da tecnologia com o trabalho, compreendido como atividade humana fundamental para produção dos meios de vida; a subordinação dos desenvolvimentos tecnológicos ao modo de produção capitalista; a crítica à modernidade e à tecnociência.",
      "bibliografiaBasica": [
        "GALIMBERTI, U. Psiche e techne: o homem na idade da técnica, São Paulo: Paulus, 2006.",
        "PINTO, A. V. O conceito de tecnologia: volume 1. Rio de Janeiro: Contraponto, 2005.",
        "MORAIS, Regis de (ORG.). Filosofia da ciência e da tecnologia: Introdução metodológica e crítica. Papirus Editora, 2013."
      ],
      "bibliografiaComplementar": [
        "MIRANDA, Luiz Felipe Sigwalt de. Introdução histórica à filosofia das ciências. Curitiba: Editora Intersaberes, 2016.",
        "REVISTA CULT - Dossiê: Heidegger e as fendas do ser. Edição 44. São Paulo: Editora Bregantini, 2001.",
        "OLIVEIRA, Rita de Cássia Matiusso de. Por uma tecnoética: Hans Jonas e o princípio responsabilidade. 2019. 87 p. Dissertação (mestrado) Centro Federal de Educação Tecnológica de Minas Gerais, Programa de Pós-Graduação em Educação Tecnológica. Belo Horizonte, 2019.",
        "OLIVEIRA, N. F.; SOUZA, R. T. Fenomenologia hoje III: bioética, biotecnologia, biopolítica. Rio Grande do Sul: EDIPUC, 2008.",
        "LEVY, P. As tecnologias da inteligência: o futuro do pensamento na era da informática. 2. ed. Rio de Janeiro: Editora 34, 2010."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "FTC",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ASEN0.01",
      "nome": "Automação em Sistemas de Energia",
      "ch": "60h",
      "periodo": 8,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [
        "G10SEMB0.01",
        "G10FCOM0.01"
      ],
      "corequisitos": [],
      "ementa": "Conceitos gerais de automação. Sensores e atuadores. Controladores lógicos programáveis. Programação de controladores industriais. Sistemas de supervisão e aquisição de dados. Tecnologias de automação em sistemas de energia e suas aplicações.",
      "bibliografiaBasica": [
        "FIALHO, A. B. Instrumentação industrial: conceitos, aplicações e análises. 7ª ed. São Paulo: Érica, 2009.",
        "NATALE, F. Automação Industrial. 10ª ed. São Paulo: Érica, 2000.",
        "PETRUZELLA, F. D. Controladores Lógicos Programáveis. 4ª ed. Porto Alegre: AMGH, 2013."
      ],
      "bibliografiaComplementar": [
        "ALVES, J. L. L. Instrumentação, Controle e Automação de Processos. 1ª ed. Rio de Janeiro: LTC, 2005.",
        "BARATELLA, A.; SANTOS L. M. M. D. Redes Industriais Para Automação Industrial: As-I, Profibus E Profinet. 2ª ed. São Paulo: Érica, 2019.",
        "JUNIOR, E. G. Introdução a sistemas de supervisão, controle e aquisição de dados SCADA. 1ª ed. Alta Books, 2019.",
        "PRUDENTE, F. Automação Industrial - PLC: Teoria e Aplicações. 2ª ed. Rio de Janeiro: LTC, 2020.",
        "SILVEIRA, P. R; SANTOS, W. E. Automação e Controle Discreto. 9ª ed. São Paulo: Érica, 2009."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "ASE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10EHID0.01",
      "nome": "Energia Hidráulica",
      "ch": "45h",
      "periodo": 8,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10FTRA0.02",
        "G10CGEN0.01",
        "G10LCGE0.01",
        "G10MAEN0.01",
        "G10HAPI0.01"
      ],
      "corequisitos": [],
      "ementa": "Aspectos gerais e classificação de centrais hidroelétricas. Estudo preliminar para aproveitamento hidráulico (medição de vazão e determinação da altura de queda). Estimativa inicial para potência disponível no eixo. Turbinas Hidráulicas (Turbina de ação Pelton; Turbinas de reação Francis e Kaplan). Elementos componentes e suas características. Dimensionamento, instalação, operação e manutenção de uma pequena central hidrelétrica (PCH).",
      "bibliografiaBasica": [
        "BRAGA JR., R. A.; SALECKER, J. C. Mini e Micro Centrais Hidroelétricas, EDUEL 1ª ED 1999.",
        "SOUZA, Z., SANTOS, A. H. M.; BORTONI, E. Centrais Hidrelétricas. Interciência 1ª ED 2009.",
        "SOUZA, Z. Projeto de Máquinas de Fluxo: TOMO IV - TURBINAS HIDRAULICAS COM ROTORES AXIAIS. Interciência."
      ],
      "bibliografiaComplementar": [
        "PAULO E., Comportas Hidráulicas. Interciência 2ª ED 2002.",
        "CENTRAIS HIDRELÉTRICAS PUC/PERU http://creativecommons.org/licenses/by-nc-sa/2.5/pe/",
        "FARRET, F. A. Aproveitamento de pequenas fontes de energia elétrica. Editora UFSM, 1ª edição, 2004.",
        "SIMONE, G.A. Centrais e aproveitamentos hidroelétricos: teoria e exercícios. São Paulo: Editora Érica, 2000.",
        "LIMA, J.M. Usinas Hidrelétricas - Diretrizes Básicas para Proteção e Controle. 1ª ed. São Paulo: Synergia, 2008."
      ],
      "horas": 37,
      "creditos": 3,
      "Sigla": "EHidr",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10AENE0.01",
      "nome": "Armazenamento de Energia",
      "ch": "30h",
      "periodo": 8,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10ELET0.01",
        "G10LELE0.01"
      ],
      "corequisitos": [],
      "ementa": "Princípios e técnicas de armazenamento de energia existentes (eletricidade/baterias, térmica/bancos de gelo, hídrico/elevação água, mecânica/volantes inerciais e molas, pneumático e hidráulico/peso morto e acumuladores de pressão, químicos etc.). Tipos de acumuladores e aplicações. Características (elétricas, mecânica, térmicas, hidráulicas, pneumáticas etc.), princípios de funcionamento, técnicas de operação e manutenção dos principais equipamentos, dispositivos e sistemas armazenadores de energia. Dimensionamento, instalação, manutenção de sistemas acumuladores de energia. Acumuladores como fonte de energia auxiliar e/ou emergência. Aplicar técnicas para modelagem de sistemas de armazenamento em aplicações em diferentes topologias de redes elétricas.",
      "bibliografiaBasica": [
        "ALDABO, Ricardo. Célula combustível e hidrogênio: fonte de energia da nova era. São Paulo: ArtLiber, 2004.",
        "LINSINGEN, I.V. Fundamentos de Sistemas Hidráulicos. 2ª ed. Florianópolis: Editora da UFSC, 2003.",
        "DAZA, Eric Fernando Boeck - SPERANDIO, Maurício. Sistemas de Armazenamento de Energia: Desafios Regulatórios e Econômicos para sua inserção em Sistemas de Potência. 1.ed. - Porto Alegre: PLUS / Simplíssimo, 2019."
      ],
      "bibliografiaComplementar": [
        "NELSON, VAUGH. Introduction to renewable energy. CRC Press, 2011.",
        "BOCCHI, N.; FERRACIN, L. C.; BIAGGIO, S. R., Pilhas e Baterias: Funcionamento e Impacto Ambiental, Química e Sociedade, nº 11, 2000.",
        "VARELA, H.; HUGUENIN, F., Materiais para cátodos de baterias secundárias de lítio, Química Nova, vol. 1, nº 2, 2002.",
        "BARAK, M., Electrochemical Power sources, primary and secondary batteries, ed. Peter Perecrinus ltda, 1980.",
        "LINDEN, D., Handbook of batteries and fuel cells, 2ª Edição, Nova Iorque, McGraw-Hill, 1995."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "ARE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10MPES0.01",
      "nome": "Metodologia da Pesquisa",
      "ch": "30h",
      "periodo": 8,
      "eixo": "Prática Profissional e Formação Diversificada",
      "prerequisitos": [
        "G10MCIE0.01"
      ],
      "corequisitos": [],
      "ementa": "Produção de trabalho técnico- científico versando sobre tema da área de Engenharia de Energia; aplicação dos conhecimentos sobre a produção de pesquisa científica: a questão, problema, a escolha do método etc.",
      "bibliografiaBasica": [
        "GIL, A. C. Como elaborar projetos de pesquisa. 5. ed. São Paulo: Atlas, 2010.",
        "LAKATOS, E. M.; MARCONI, M. A. Fundamentos de metodologia científica. 7. ed. São Paulo: Atlas, 2010.",
        "LAKATOS, E. M.; MARCONI, M. A. Técnicas de pesquisa: planejamento e execução de pesquisas, amostragens e técnicas de pesquisas, elaboração, análise e interpretação de dados. 7. ed. São Paulo: Atlas, 2011."
      ],
      "bibliografiaComplementar": [
        "DEMO, P. Metodologia do conhecimento científico. São Paulo: Atlas, 2000.",
        "FRANÇA, J. L. Manual para normalização de publicações técnico- científicas. 8. ed. Belo Horizonte: Ed. UFMG, 2007.",
        "OLIVEIRA, S. L. Tratado de metodologia científica: projetos de pesquisas, TGI, PFC, monografias, dissertações e teses. 2. ed. São Paulo: Pioneira, c1999.",
        "SEVERINO, Antônio Joaquim. Metodologia do trabalho científico. 23. ed. rev. e atual. São Paulo: Cortez, 2007.",
        "TAKAHASHI, Ricardo H. C. A estrutura do conhecimento tecnológico do tipo científico. Belo Horizonte: Editora UFMG, 2009."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "MP",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10MENE0.01",
      "nome": "Mercado de Energia",
      "ch": "30h",
      "periodo": 9,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10PEPR0.01",
        "G10EAEE0.01"
      ],
      "corequisitos": [],
      "ementa": "Mercados de energia elétrica e de combustíveis. Modelo regulatório do Setor Elétrico Brasileiro. Agentes do mercado de energia Elétrica. Conceitos de segurança energética. Comercialização de energia. Ambientes de contratação de energia. Estruturas e falhas de mercado: Mercados energéticos; Externalidades da energia; Regulamentações e políticas energéticas; Energia e crescimento econômico; Energia como commodity. Leilões de Energia.",
      "bibliografiaBasica": [
        "PAULO SERGIO DA SILVA SEIXAS. Eficiência energética. Contentus, 2020.",
        "NELSON KAGAN; CARLOS CÉSAR BARIONI DE OLIVEIRA; ERNESTO JOÃO ROBBA. Introdução aos Sistemas de Distribuição de Energia Elétrica. Editora Blucher, 2010.",
        "NELSON KAGAN, ERNESTO JOÃO ROBBA, HERNÁN PRIETO SCHMIDT. Estimação de indicadores de qualidade da energia elétrica. Editora Blucher, 2009."
      ],
      "bibliografiaComplementar": [
        "ROBERTO MAYO. Mercados de Eletricidade. Produção, Transmissão, Comercialização, Consumo e Derivativos de Energia. 2a Edição, 2021. Editora Synergia.",
        "CIGRÉ, Eduardo Nery (organizador). Resiliência de Sistemas Eletroenergéticos. Editora Interciência, 2019.",
        "NERY, Eduardo. Mercados e regulação de energia elétrica. Editora Interciência, 2012.",
        "ΑΝΙΤΑ ΚΟΝ; ELIZABETH BORELLI. Aportes ao Desenvolvimento da Economia Brasileira. Editora Blucher, 2015.",
        "SANTOS, Paulo E. Tarifas de Energia Elétrica. 1a ed. Ed. Interciência, 2011."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "MERE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10GDSD0.01",
      "nome": "Geração Distribuída e Sistemas de Distribuição",
      "ch": "60h",
      "periodo": 9,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10EPOT0.01",
        "G10SETE0.01",
        "G10ASEN0.01"
      ],
      "corequisitos": [],
      "ementa": "Introdução ao contexto social, econômico e tecnológico de smart-grids. Geração distribuída: Fotovoltaica, termoelétrica, energia eólica e células de combustível. Identificar os tipos de sistemas de armazenamento e suas formas de integração com o sistema elétrico, considerando aspectos técnicos. Armazenamento de energia. Veículos elétricos e micro redes. Aplicação de microcontroladores em redes inteligentes. Avaliar e aplicar os modelos de resposta a demanda na análise de sistemas de geração distribuída.",
      "bibliografiaBasica": [
        "SALESSE, A. V.; MARQUES, R. F. Aspectos Relativos à Conexão de Geração Distribuída nos Sistemas de Distribuição de Energia Elétrica. International Congress on Electricity Distribution- CIDEL 2006 - Argentina.",
        "BORTONI, E. C.; HADDAD, J. Interconexão de Sistemas de Geração Distribuída. 1ª.ed. Rio de Janeiro: Interciência, 2006.",
        "LORA, E.E.S.; ADDAD, J. Geração Distribuída: aspectos tecnológicos, ambientais e institucionais. Rio de Janeiro: Interciência, 2006."
      ],
      "bibliografiaComplementar": [
        "CIGRÉ Working group 37.23, Impact of increasing contribution of dispersed generation on the power system, CIGRÉ, Relatório Técnico, 1999.",
        "MITRA, P. The impact of distributed photovoltaic generation on residential distribution systems. Arizona State University, submitted to IEEE, 2012.",
        "MME - Ministério de Minas e Energia, 2010. Portaria Interministerial nº 1.007, de 31 de dezembro de 2010.",
        "COGEN. ASSOCIAÇÃO DA INDÚSTRIA DE COGERAÇÃO DE ENERGIA. Geração Distribuída - Novo Ciclo de Desenvolvimento.",
        "GRADITI, G. Distributed Energy Resources in Local Integrated Energy Systems: Optimal Operation and Planning. Elsevier, 2021."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "GDSD",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10MELE0.01",
      "nome": "Mobilidade Elétrica",
      "ch": "30h",
      "periodo": 9,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10AENE0.01"
      ],
      "corequisitos": [],
      "ementa": "Histórico e evolução da eletromobilidade; Introdução à Eletromobilidade: tipologia dos modais e infraestrutura de recarga; Introdução aos componentes: Powertrain, Baterias e carregadores. Regulação, instrumentos de política e governança para a eletromobilidade. Ferramentas e instrumentos analíticos para elaboração e avaliação de projetos em mobilidade de baixa emissão.",
      "bibliografiaBasica": [
        "ARORA, S. Heavy-Duty Electric Vehicles: From Concept to Reality. 1ed, Butterworth-Heinemann, 2021.",
        "CORTESE, T. T. P., KNIESS, C. T. /MACCARI, M. A. Cidades inteligentes e sustentáveis. Barueri: Manole, 1ª edição, 2017.",
        "AHMED, Ashfaq. Eletrônica de Potência. São Paulo: Pearson Prentice Hall, 1ª edição, 2000."
      ],
      "bibliografiaComplementar": [
        "AGUIRRE, L. A. Fundamentos de Instrumentação. São Paulo: Pearson, 1ª edição, 2013.",
        "BOSCH, R. Manual de tecnologia automotiva. São Paulo: Edgard Blücher, 25ª edição, 2005.",
        "DELGADO, F., COSTA, J. G., FEBRARO, J., SILVA, T. B. Caderno de Carros Elétricos. Rio de Janeiro: FGV Energia, ANO 4-N° 7, 2017.",
        "BOSE, Bimal. K. Modern Power Electronics and AC Drives. São Paulo: Prentice Hall, 2ª edição, 2001.",
        "MOHAN, NED; UNDELAND, Tore M.; ROBBINS, William P. Power Electronics Converters, Applications and Design. -: IE-WILEY, 3ª edição, 2002."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "MobiE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10EENE0.01",
      "nome": "Eficiência Energética",
      "ch": "60h",
      "periodo": 9,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10PIEL0.01"
      ],
      "corequisitos": [],
      "ementa": "Conceito de eficiência energética, indicadores de eficiência energética. Práticas de uso eficiente da energia em instalações residenciais, comerciais e industriais: iluminação, condicionamento ambiental e força motriz. Programas de conservação de energia elétrica. Gerenciamento da energia elétrica pelo lado da demanda: conceitos, técnicas utilizadas, exemplos práticos. Sistemas de gestão da eficiência energética nas organizações.",
      "bibliografiaBasica": [
        "BARROS, B. F.; Borelli, R.; GEDRA, R. L. Gerenciamento de Energia: ações administrativas e técnicas de uso adequado da energia elétrica. São Paulo: Érica, 2010.",
        "CAPELLI, A. Energia Elétrica para Sistemas Automáticos da Produção. São Paulo: Érica, 2007.",
        "KAEHLER, J.W. M. e Chagas, N.B. Eficiência Energética da Avaliação à Auditoria Energética. Editora Dialética, 1 ed., 2024."
      ],
      "bibliografiaComplementar": [
        "CORTEZ, L. A. B., LORA, E. E. S., GOMEZ, E. O. (org). Biomassa para Energia. São Paulo: Editora Unicamp, 2008.",
        "GOLDEMBERG, J.; LUCON, O. S. Energia, meio ambiente e desenvolvimento. 3. ed. rev. ampl. São Paulo: Edusp, 2011.",
        "PEREIRA A. L. et al. Logística reversa e sustentabilidade, 1ª. Ed. São Paulo, Cencage, 2011.",
        "TOLMASQUIN, M. T. (org). Fontes Renováveis de Energia no Brasil. Rio de Janeiro: Interciência, 2003.",
        "PANESI A. R. Q. Fundamentos da Eficiência Energética (Industrial, Comercial e Residencial). Editora: Ensino Profissional, 2006."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "EfE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10PFCU1.02",
      "nome": "Projeto Final de Curso I",
      "ch": "15h",
      "periodo": 9,
      "eixo": "Prática Profissional e Formação Diversificada",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Primeira etapa do desenvolvimento do trabalho de conclusão de curso, focada na definição do tema, revisão bibliográfica e elaboração do projeto de pesquisa.",
      "bibliografiaBasica": [],
      "bibliografiaComplementar": [],
      "horas": 12,
      "creditos": 1,
      "Sigla": "PFC1",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ECOB1.02",
      "nome": "Estágio Curricular Obrigatório",
      "ch": "195h",
      "periodo": 9,
      "eixo": "Prática Profissional e Formação Diversificada",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Atividades práticas em ambiente profissional, supervisionadas, para aplicação dos conhecimentos teóricos e desenvolvimento de competências da engenharia.",
      "bibliografiaBasica": [],
      "bibliografiaComplementar": [],
      "horas": 162,
      "creditos": 13,
      "Sigla": "EstgO",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10PAOR0.01",
      "nome": "Psicologia Aplicada às Organizações",
      "ch": "30h",
      "periodo": 10,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10ISOC0.01",
        "G10IDIR0.01"
      ],
      "corequisitos": [],
      "ementa": "O trabalho, sua história, seus significados e função psicológica. O trabalho no contexto neoliberal e a precarização. Comportamento x subjetividade. Saúde mental e trabalho, adoecimento e assédio. Direitos humanos e trabalho. Diversidades, inclusão e equidade: relações étnico-raciais e cultura, sexualidade, relações de gênero, pessoas com deficiências. Discussões contemporâneas sobre o trabalho.",
      "bibliografiaBasica": [
        "ROBBINS, Stephen Paul. Comportamento organizacional. 11. ed. São Paulo: Pearson Prentice Hall, 2005.",
        "CARRARA, Sérgio (org.) et al. Gênero e diversidade na escola: formação de professoras/es em gênero, sexualidade, orientação sexual e relações étnico-raciais; caderno de atividades. Rio de Janeiro: CEPESC, 2009.",
        "MILKOVICH, George T.; BOUDREAU, John W. Administração de recursos humanos. São Paulo: Atlas, 2000."
      ],
      "bibliografiaComplementar": [
        "REIS, Evelyse Iwai dos. Corpo consciente e saúde do trabalhador. Curitiba: Contentus, 2020.",
        "ZANELLI, José Carlos; BORGES-ANDRADE, Jairo Eduardo; BASTOS, Antonio Virgílio Bittencourt (org.). Psicologia, organizações e trabalho no Brasil. 2. ed. Porto Alegre: Artmed, 2014.",
        "CARVALHO, Nordson Gonçalves de. Assédio Moral na Relação de Trabalho. São Paulo: Editora Rideel, 2009.",
        "AREOSA, Silvia Virginia Coutinho; MARCON, Silvana Regina Ampessan. Riscos e proteção psicossocial: trabalho, saúde mental e práticas sociais. Porto Alegre: Editora EdiPUC-RS, 2021.",
        "MUNANGA, Kabengele. Negritude: usos e sentidos. 4. ed. Belo Horizonte: Autêntica, 2019."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "PAO",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10GENE0.01",
      "nome": "Geopolítica da Energia",
      "ch": "30h",
      "periodo": 10,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10MENE0.01"
      ],
      "corequisitos": [],
      "ementa": "Matrizes energéticas: repercussões na geopolítica internacional. Atual transição energética frente ao contexto geopolítico contemporâneo. Desafios brasileiros em segurança energética. Crises energéticas.",
      "bibliografiaBasica": [
        "HIRDAN KATARINA DE MEDEIROS COSTA et al. Transição Energética, Justiça Geracional e Mudanças Climáticas. Editora Lumen Juris, 1ª Edição, 2020.",
        "RONALDO GOMES CARMONA. Geopolítica e Energia. Editora Synergia. 1ª Edição, 2020.",
        "SIQUEIRA, Iony Patriota de. Redes de Infraestruturas Críticas - Análise de Desempenho e Riscos dos Setores de Energia, Petróleo, Gás, Água, Finanças, Logística e Comunicações. Editora Interciência, 2014."
      ],
      "bibliografiaComplementar": [
        "MAURÍCIO VAITSMAN. O Petróleo no Império e na República. [S.l.]: Editora Interciência, 2001.",
        "ΑΝΙΤΑ ΚΟΝ; ELIZABETH BORELLI. Aportes ao Desenvolvimento da Economia Brasileira. Editora Blucher, 2015.",
        "ANGELO AUGUSTO VALLES DE SÁ MAZZAROTTO; SILVA, Rodrigo de Cássio da. Gestão da sustentabilidade urbana: leis, princípios e reflexões. Editora Intersaberes, 2017.",
        "CÉLIO LUIZ BANASZESKI. Gestão da qualidade, meio ambiente e sustentabilidade. Contentus, 2020.",
        "NERY, Eduardo. Mercados e regulação de energia elétrica. Editora Interciência, 2012."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "GEOE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10GENR0.01",
      "nome": "Gestão Energética",
      "ch": "30h",
      "periodo": 10,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10MENE0.01"
      ],
      "corequisitos": [],
      "ementa": "Modelos de planejamento energético. Equivalência entre fontes de energia. Estrutura de produção e de consumo de energia. Dimensões econômicas da energia. Indicador de intensidade energética. Política energética.",
      "bibliografiaBasica": [
        "EDUARDO DÍAZ DE LA CRUZ; JAIME DÍAZ DE LA CRUZ. Automação Predial 4.0: A Automação Predial na Quarta Revolução. Editora Brasport, 2019.",
        "MAMEDE FILHO, João. Instalações elétricas industriais. 8. ed. Rio de Janeiro: LTC, c2010.",
        "ALINE MEDEIROS FERREIRA DE ARAUJO. Bim plataforma 6D e 7D: sustentabilidade e ciclo de vida. Contentus, 2020."
      ],
      "bibliografiaComplementar": [
        "PAULO SERGIO DA SILVA SEIXAS. Eficiência energética. Contentus, 2020.",
        "CÉLIO LUIZ BANASZESKI. Gestão da qualidade, meio ambiente e sustentabilidade. Contentus, 2020.",
        "ANGELO AUGUSTO VALLES DE SÁ MAZZAROTTO; SILVA, Rodrigo de Cássio da. Gestão da sustentabilidade urbana: leis, princípios e reflexões. Editora Intersaberes, 2017.",
        "GUILHERME ZIRR. Gestão de custo de energia. Contentus, 2020.",
        "CAMPOS, Mario Cesar Massa de; Gomes, Marcos V. de Carvalho; Perez, José M. Gonzalez Tubio. Controle avançado e otimização na indústria do petróleo. Editora Interciência, 2013."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "GENE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10PFCU2.02",
      "nome": "Projeto Final de Curso II",
      "ch": "15h",
      "periodo": 10,
      "eixo": "Prática Profissional e Formação Diversificada",
      "prerequisitos": [
        "G10PFCU1.02"
      ],
      "corequisitos": [],
      "ementa": "Segunda etapa do desenvolvimento do trabalho de conclusão de curso, focada na execução do projeto, análise de resultados, redação final e defesa.",
      "bibliografiaBasica": [],
      "bibliografiaComplementar": [],
      "horas": 12,
      "creditos": 1,
      "Sigla": "PFC2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ESUP0.01",
      "nome": "Estágio Supervisionado",
      "ch": "15h",
      "periodo": 10,
      "eixo": "Prática Profissional e Formação Diversificada",
      "prerequisitos": [
        "G10ECOB1.02"
      ],
      "corequisitos": [],
      "ementa": "Complementação do estágio obrigatório, com foco no relatório final e na avaliação da experiência profissional adquirida.",
      "bibliografiaBasica": [],
      "bibliografiaComplementar": [],
      "horas": 12,
      "creditos": 1,
      "Sigla": "EstgS",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Obrigatória"
    },
    {
      "id": "G10ALIN0.01",
      "nome": "Álgebra Linear",
      "ch": "60h",
      "periodo": 4,
      "eixo": "Matemática",
      "prerequisitos": [
        "G10GAAL0.01"
      ],
      "corequisitos": [],
      "ementa": "Espaços vetoriais, subespaços, base, dimensão. Transformações lineares e matriz de uma transformação Linear. Teorema do Núcleo e da Imagem. Autovalores e Autovetores; produto interno; ortonormalização; diagonalização de operadores, Teorema de Cayley-Hamilton e Teorema Espectral; Formas quadráticas; aplicações.",
      "bibliografiaBasica": [
        "BOLDRINI, José Luiz. Álgebra linear. 3. ed. São Paulo: Harbra, c1986.",
        "BOULOS, Paulo. Geometria analítica: um tratamento vetorial. 3. ed. São Paulo: Pearson Education do Brasil, 2005.",
        "WINTERLE, Paulo. Geometria analítica. 2. ed. São Paulo: Pearson Makron Books, c1987."
      ],
      "bibliografiaComplementar": [
        "CALLIOLI, Carlos A.; DOMINGUES, Hygino H.; COSTA, Roberto C. F. Álgebra linear e aplicações. 6. ed. reform. São Paulo: Atual, c1990.",
        "LANG, Serge. Álgebra linear. Rio de Janeiro: Ciência Moderna, c2003.",
        "STENINBRUCH, Alfredo. WINTERLE, Paulo. Álgebra linear. 2. ed. São Paulo: Pearson Education do Brasil, c1987.",
        "SANTOS, Nathan Moreira dos. Vetores e matrizes: uma introdução à álgebra linear. 4. ed. São Paulo: Cencage Learning, c2007.",
        "POOLE, David. Álgebra linear. São Paulo: Cengage Learning, c2004."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "AL",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10IMEF1.01",
      "nome": "Introdução ao Método dos Elementos Finitos",
      "ch": "30h",
      "periodo": 5,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [
        "G10MNCO0.01",
        "G10EDPA0.01"
      ],
      "corequisitos": [],
      "ementa": "Formulações matemáticas para problemas de contorno. Equações de Maxwell. Métodos de resíduos ponderados e de Galerkin. Método de Elementos Finitos em duas e três dimensões. Técnicas de programação básicas para o método de Elementos Finitos. Introdução à geração de malhas. Funções de forma. Elementos unidimensionais, bidimensionais e tridimensionais. Formulação isoparamétrica. Integração numérica. Elementos Lagrangianos e Serendipity. Erros, estimativa de erros e convergência. Aplicações.",
      "bibliografiaBasica": [
        "RIBEIRO, Fernando Luiz Bastos, Introdução Ao Método dos Elementos Finitos, Ciência Moderna, 2020.",
        "CHANDRUPATLA, Tirupathi R. e BELEGUNDU, Ashok D., Elementos Finitos, Editora Pearson, 4a ed., 2014.",
        "GONÇALVES, Marina Vargas Reis de Paula. Métodos Numéricos em Equações Diferenciais, Editora Contentus, la ed., 2020."
      ],
      "bibliografiaComplementar": [
        "LI, Gang. Introduction to the Finite Element Method and Implementation with MATLAB® (English Edition) 1ª ed, Cambridge University Press, 2020.",
        "FILHO, Avelino Alves. Elementos Finitos - A base da tecnologia CAE, Editora Érica, 6ª ed., 2018.",
        "WHITELEY, Jonathan. Finite Element Methods: A Practical Guide (Mathematical Engineering) (English Edition) 1st ed. 2017. Springer.",
        "TEIXEIRA-DIAS, F., PINHO-DA-CRUZ, J., VALENTE, R. A. Fontes, SOUZA, R. J. Alves de. Método dos Elementos Finitos. Técnicas de Simulação Numérica em Engenharia. Editora ETEP, 2ª ed., 2018.",
        "CARDOSO, José Roberto. Electromagnetics Through the Finite Element Method: A Simplified Approach Using Maxwell's Equations, Editora CRC Press, la ed., 2019."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "IMEF",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10MEFA1.01",
      "nome": "Método dos Elementos Finitos Aplicado",
      "ch": "30h",
      "periodo": 6,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [
        "G10IMEF1.01",
        "G10ELER0.01"
      ],
      "corequisitos": [],
      "ementa": "Revisão do eletromagnetismo. Campos eletromagnéticos. Equações de Maxwell e equações construtivas do eletromagnetismo. Métodos numéricos para a solução de equações diferenciais parciais. Introdução aos métodos aproximados. Métodos dos elementos finitos. Abordagem do pré-processamento, processamento e pós-processamento. MEF em uma dimensão e duas dimensões. Programa computacional.",
      "bibliografiaBasica": [
        "CARDOSO, José Roberto. Electromagnetics Through the Finite Element Method: A Simplified Approach Using Maxwell's Equations, Editora CRC Press, la ed., 2019.",
        "CHANDRUPATLA, Tirupathi R. e BELEGUNDU, Ashok D., Elementos Finitos, Editora Pearson, 4a ed., 2014.",
        "GONÇALVES, Marina Vargas Reis de Paula. Métodos Numéricos em Equações Diferenciais, Editora Contentus, la ed., 2020."
      ],
      "bibliografiaComplementar": [
        "LI, Gang. Introduction to the Finite Element Method and Implementation with MATLAB® (English Edition) 1ª ed, Cambridge University Press, 2020.",
        "FILHO, Avelino Alves. Elementos Finitos - A base da tecnologia CAE, Editora Érica, 6ª ed., 2018.",
        "WHITELEY, Jonathan. Finite Element Methods: A Practical Guide (Mathematical Engineering) (English Edition) 1st ed. 2017. Springer.",
        "TEIXEIRA-DIAS, F., PINHO-DA-CRUZ, J., VALENTE, R. A. Fontes, SOUZA, R. J. Alves de. Método dos Elementos Finitos. Técnicas de Simulação Numérica em Engenharia. Editora ETEP, 2ª ed., 2018.",
        "RIBEIRO, Fernando Luiz Bastos, Introdução Ao Método dos Elementos Finitos, Ciência Moderna, 2020."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "MEFA",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10OTIM1.01",
      "nome": "Otimização I",
      "ch": "60h",
      "periodo": 4,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [
        "G10PRCO2.01",
        "G10LPCO2.01",
        "G10GAAL0.01",
        "G10MNCO0.01"
      ],
      "corequisitos": [],
      "ementa": "Introdução à pesquisa operacional; modelagem de problemas e classificação de modelos matemáticos; programação linear; método simplex; dualidade; análise de sensibilidade; interpretação econômica; modelos de transporte e alocação; uso de pacotes computacionais.",
      "bibliografiaBasica": [
        "GOLDBARG, Marco César; LUNA, Henrique Pocca Loureiro. Otimização combinatória e programação linear: modelos e algoritmos. 2. ed. rev. e ampl. Rio de Janeiro: Elsevier, 2005.",
        "LONGARAY, André Andrade. Introdução à pesquisa operacional. São Paulo: Saraiva, 2014.",
        "HILLIER, Frederick S.; LIEBERMAN, Gerald J. Introdução à pesquisa operacional. 9. ed. Porto Alegre: AMGH, 2013."
      ],
      "bibliografiaComplementar": [
        "ANDRADE, Eduardo Leopoldino de. Introdução à pesquisa operacional: métodos e modelos para análise de decisões. 4. ed. Rio de Janeiro: LTC, 2009.",
        "LOESCH, Claudio. Pesquisa operacional: fundamentos e modelos. São Paulo: Saraiva, 2009.",
        "LEAL NETO, José de Souza. Pesquisa operacional. São Paulo: Contentus, 2020.",
        "KAGAN, Nelson; SCHMIDT, Hernán Prieto; OLIVEIRA, Carlos César Barioni de.; KAGAN, Henrique. Métodos de otimização aplicados a sistemas elétricos de potência. São Paulo: Editora Blucher, 2009.",
        "TAHA, Hamdy A. Pesquisa Operacional. 8. ed. São Paulo: Editora Pearson, 2007."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "OT1",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10OTIM2.01",
      "nome": "Otimização II",
      "ch": "60h",
      "periodo": 5,
      "eixo": "Computação e Matemática Aplicada",
      "prerequisitos": [
        "G10OTIM1.01"
      ],
      "corequisitos": [],
      "ementa": "Teoria da decisão: com e sem experimentação, valor esperado da informação perfeita, análise de sensibilidade; Teoria de jogos: equilíbrio de Nash, jogo com dois jogadores de soma zero; Introdução aos processos estocásticos; Teoria das filas; modelagem e simulação; alguns problemas clássicos de pesquisa operacional envolvendo simulação.",
      "bibliografiaBasica": [
        "GOLDBARG, Marco César; LUNA, Henrique Pocca Loureiro. Otimização combinatória e programação linear: modelos e algoritmos. 2. ed. rev. e ampl. Rio de Janeiro: Elsevier, 2005.",
        "LONGARAY, André Andrade. Introdução à pesquisa operacional. São Paulo: Saraiva, 2014.",
        "HILLIER, Frederick S.; LIEBERMAN, Gerald J. Introdução à pesquisa operacional. 9. ed. Porto Alegre: AMGH, 2013."
      ],
      "bibliografiaComplementar": [
        "ANDRADE, Eduardo Leopoldino de. Introdução à pesquisa operacional: métodos e modelos para análise de decisões. 4. ed. Rio de Janeiro: LTC, 2009.",
        "LOESCH, Claudio. Pesquisa operacional: fundamentos e modelos. São Paulo: Saraiva, 2009.",
        "LEAL NETO, José de Souza. Pesquisa operacional. São Paulo: Contentus, 2020.",
        "KAGAN, Nelson; SCHMIDT, Hernán Prieto; OLIVEIRA, Carlos César Barioni de.; KAGAN, Henrique. Métodos de otimização aplicados a sistemas elétricos de potência. São Paulo: Editora Blucher, 2009.",
        "TAHA, Hamdy A. Pesquisa Operacional. 8. ed. São Paulo: Editora Pearson, 2007."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "OT2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10IINS2.01",
      "nome": "Inglês Instrumental II",
      "ch": "30h",
      "periodo": 5,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10IINS1.01"
      ],
      "corequisitos": [],
      "ementa": "Desenvolvimento da capacidade de leitura e compreensão de textos técnico científicos em língua inglesa.",
      "bibliografiaBasica": [
        "MURPHY, Joseph. English grammar in use: a self-study reference and practice book for elementary students of english, with answers. 3rd. Cambridge, Mass.: Cambridge University Press, 2004.",
        "SANTOS, Denise. Como ler melhor em inglês. Barueri: Disal, c2011.",
        "SWAN, Michael. Practical english usage. 3rd Oxford: Oxford University Press, 2005."
      ],
      "bibliografiaComplementar": [
        "PASSWORD: k dictionaries: english dictionary for speakers of portuguese. 2. ed. São Paulo: Martins Fontes, 1998.",
        "OSHIMA, Alice; HOGUE, Ann. Writing academic english. 4. ed. White Plains: Pearson Longman, c2006.",
        "NETTLE, Mark; HOPKINS, Diana. Developing grammar in context: intermediate with answers. Cambridge: Cambridge University Press, 2003.",
        "LONGMAN dictionary of contemporary English: for advanced learners. 5. ed. Harlow: Pearson Education, 2009.",
        "MURPHY, Raymond; SMALZER, William R. Grammar in use intermediate. 3. ed. Cambridge; New York: Cambridge University Press, 2009."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "ING2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10LIBR1.01",
      "nome": "Libras I",
      "ch": "30h",
      "periodo": 5,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [],
      "corequisitos": [],
      "ementa": "Língua Brasileira de Sinais Libras e suas especificidades. História, cultura e identidade dos surdos. Parâmetros linguísticos. Sinais temáticos contextualizados com atividades e práticas de sinalização. Abordagens de comunicação inicial com os surdos.",
      "bibliografiaBasica": [
        "QUADROS, R. M. de. Educação de surdos: a aquisição da linguagem. Porto Alegre: Artmed, 1997.",
        "QUADROS, R. M. KARNOPP, L. B. Língua Brasileira de Sinais: estudos linguísticos. Porto Alegre: Artmed, 2004.",
        "CAPOVILLA, F.C.; RAPHAEL, W. D.; MAURICIO, A. C. Novo Deit-libras: dicionário enciclopédico ilustrado trilingue da Língua Brasileira de Sinais. Ed. USP; INEP; CNPq, 2009, 2 ν."
      ],
      "bibliografiaComplementar": [
        "FIGUEIRA, A. dos S. Material de apoio para o aprendizado de Libras. São Paulo: Phorte, 2011.",
        "SKILIAR, C(Org). A surdez: um olhar sobre as diferenças. 4. ed. Porto Alegre: Mediação, 2010.",
        "FERNANDES, E. (Org.) Surdez e bilinguismo. 3. ed. Porto Alegre: Mediação, 2010.",
        "GESSER, A. O ouvinte e a surdez: sobre ensinar e aprender a Libras. São Paulo: Parábola, 2012.",
        "GESSER, A. Libras?: que língua é essa?: crenças e preconceitos entorno da língua de sinais e da realidade surda. São Paulo: Parábola, 2015."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LBS1",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10LIBR2.01",
      "nome": "Libras II",
      "ch": "30h",
      "periodo": 6,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10LIBR1.01"
      ],
      "corequisitos": [],
      "ementa": "A evolução histórica até os dias atuais. Filosofias educacionais em relação aos surdos. Aprofundamento das práticas conversacionais em Libras, em suas diversas formas de comunicação, contextualizado por situações do cotidiano em espaços diversos.",
      "bibliografiaBasica": [
        "QUADROS, R. M. de. Educação de surdos: a aquisição da linguagem. Porto Alegre: Artmed, 1997.",
        "QUADROS, R. M. KARNOPP, L. B. Língua Brasileira de Sinais: estudos linguísticos. Porto Alegre: Artmed, 2004.",
        "CAPOVILLA, F.C.; RAPHAEL, W. D.; MAURICIO, A. C. Novo Deit-libras: dicionário enciclopédico ilustrado trilingue da Língua Brasileira de Sinais. Ed. USP; INEP; CNPq, 2009, 2 ν."
      ],
      "bibliografiaComplementar": [
        "FIGUEIRA, A. dos S. Material de apoio para o aprendizado de Libras. São Paulo: Phorte, 2011.",
        "SKILIAR, C(Org). A surdez: um olhar sobre as diferenças. 4. ed. Porto Alegre: Mediação, 2010.",
        "FERNANDES, E. (Org.) Surdez e bilinguismo. 3. ed. Porto Alegre: Mediação, 2010.",
        "GESSER, A. O ouvinte e a surdez: sobre ensinar e aprender a Libras. São Paulo: Parábola, 2012.",
        "GESSER, A. Libras?: que língua é essa?: crenças e preconceitos entorno da língua de sinais e da realidade surda. São Paulo: Parábola, 2015."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LBS2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10GPRO1.01",
      "nome": "Gestão de Processos",
      "ch": "30h",
      "periodo": 5,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10IDIR0.01"
      ],
      "corequisitos": [],
      "ementa": "Introdução aos conceitos de gerenciamento de processos de negócios. O pensamento estratégico da gestão por processos. O Ciclo BPM. Agregação de valor através da visão BPM. As ferramentas BPMS. A notação BPMN. Modelagem de processos de negócios. Análise e documentação de processos. Desenho de processos. Monitoramento e controle de processos. Indicadores chave de desempenho na gestão por processos. Tecnologia e transformação de processos.",
      "bibliografiaBasica": [
        "ASSOCIATION OF BUSINESS PROCESS MANAGEMENT PROFESSIONALS INTERNATIONAL. BPM CBOK: Version 4.0. São Paulo: ABPMP, 2021.",
        "CAPOTE, G. Guia para formação de analistas de processos. Rio de Janeiro: Ed. Bookess, 2016.",
        "PALADINI, E. Gestão da Qualidade: teoria e prática.4. ed. São Paulo: Atlas, 2019."
      ],
      "bibliografiaComplementar": [
        "SMITH, H.; FINGAR, P. Business process management: the third wave. Tampa, Fl, USA: Meghan-Kiffer Press, 2003.",
        "PALADINI, E.P; BRIDI, E. Gestão e Avaliação da Qualidade em Serviços para Organizações Competitivas. São Paulo: Atlas, 2013.",
        "CARPINETTI, L.C.R; GEROLAMO, M.C. Gestão da Qualidade ISSO 9001:2015: requisitos e integração com a ISSO 14001:2015. São Paulo: Atlas, 2022",
        "PAIM, R; CARDOSO, V.; CAULLIRAUX, H.; CLEMENTE, R. Gestão de Processos: pensar, agir e aprender. Bookman, 2009.",
        "ARAÚJO, L.C.G. de, GARCIA, A.A., MARTINES, S. Gestão de Processos - Melhores Resultados e Excelência Organizacional. São Paulo, 2a ed. 2016, Editora Atlas."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "GPROC",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10GPES1.01",
      "nome": "Gestão de Pessoas",
      "ch": "30h",
      "periodo": 5,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10IDIR0.01"
      ],
      "corequisitos": [],
      "ementa": "O Indivíduo e as organizações. A motivação humana no trabalho. Poder e conflito. Liderança e gerência. Comunicação. Saúde e segurança no trabalho. Cultura brasileira e cultura organizacional. Clima organizacional. Qualidade de Vida no Trabalho.",
      "bibliografiaBasica": [
        "ALMEIDA, W. Captação e seleção de talentos: com foco em competências. 2.ed. São Paulo: Atlas, 2009.",
        "MILKOVICH, G.T; BOUDREAU, J.W. Administração de Recursos Humanos. São Paulo: Atlas, 2015.",
        "BRANDÃO, H. P. Mapeamento de competências: ferramentas, exercícios e aplicações em gestão de pessoas. 2. ed. São Paulo: Atlas, 2017."
      ],
      "bibliografiaComplementar": [
        "CHIAVENATO, I. Gestão de pessoas: o novo papel da gestão do talento humano. São Paulo: Atlas, 2020.",
        "CHIAVENATO, I. Recursos humanos: o capital humano das organizações. São Paulo: Atlas, 2020.",
        "VERGARA, S. C. Gestão de pessoas. 16. ed. São Paulo: Atlas, 2016.",
        "ROBBINS, S.P; JUDGE, T.A. Comportamento Organizacional. 18. ed. São Paulo: Pearson, 2020.",
        "SOBOLL, L. A; FERRAZ, D.L. da S. (Org). Gestão de Pessoas: armadilhas da organização do trabalho. São Paulo: Atlas, 2014."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "GPESS",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10GPUB0.01",
      "nome": "Gestão Pública",
      "ch": "30h",
      "periodo": 8,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10GEMP0.01"
      ],
      "corequisitos": [],
      "ementa": "Conhecimentos sobre a gestão pública e fiscal, sistema de controle interno e o resultado social das entidades públicas, organização e funcionamento do controle interno em nível municipal. Gastos com pessoal. Dívida pública e endividamento. Transparência, controle e fiscalização. Gestão Fiscal. Execução orçamentária. Prestação de contas. Fiscalização da gestão fiscal. Organização, estruturação e o funcionamento do Sistema de Controle Interno. Balanço social: as metas projetadas e os resultados alcançados.",
      "bibliografiaBasica": [
        "NASCIMENTO, E. R. Gestão Pública 4. ed. Saraiva UNI. 2020.",
        "KANAANE, R.; FIEL, A. F. e FERREIRA, M. das G. Gestão Pública: planejamento, processos, sistema de informação e pessoas. São Paulo: Atlas, 2010.",
        "CORRALO, G. da S. Curso de direito municipal. São Paulo: Atlas, 2011."
      ],
      "bibliografiaComplementar": [
        "MEIRELLES, H. L. Direito municipal brasileiro. 19. ed. São Paulo: Malheiros, 2021.",
        "BERNARDONI, D. L. e CRUZ, J. A. W. Planejamento e Orçamento na Administração Pública. 2ª ed. Editora Intersaberes, 2012.",
        "GIACOMONI, J. Orçamento Público. 18. ed. São Paulo: Atlas, 2021.",
        "SLOMSKI, V. Controladoria e Governança na Gestão Pública. São Paulo: Atlas, 2018",
        "OSBORNE, D.; GAEBLER, T. Reinventando o governo. 9. ed. Brasília: MH Comunicação, 1997."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "GPUB",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10EPEM0.01",
      "nome": "Estratégia e Planejamento de Empresas",
      "ch": "30h",
      "periodo": 8,
      "eixo": "Humanidades e Ciências Sociais Aplicadas",
      "prerequisitos": [
        "G10GEMP0.01"
      ],
      "corequisitos": [],
      "ementa": "Introdução ao planejamento estratégico; conceitos básicos: estratégia, missão, visão, valores; formulação da estratégia: em nível de negócio, nível corporativo, aquisições e reestruturações, internacionalização; ferramentas de análise estratégica: SWOT, cenários, forças competitivas de Porter, matriz de Ansoff, matriz BCG, matriz GE/McKinsey.",
      "bibliografiaBasica": [
        "CHIAVENATO, I.; SAPIRO, A. Planejamento estratégico. 5. ed. Rio de janeiro: Elsevier, 2023.",
        "HITT, M. A.; IRELAND, R. D.; HOSKISSON, R. E. Administração estratégica: competitividade e globalização. São Paulo: Cengage Learning, 2019.",
        "OLIVEIRA, D. P. R. Planejamento estratégico. 35. ed. São Paulo: Altas, 2023."
      ],
      "bibliografiaComplementar": [
        "ALMEIDA, M. I. R, ALMEIDA, F.R. Manual de planejamento estratégico: desenvolvimento de um plano estratégico com utilização de planilhas excel. 4. Ed. São Paulo: Sarvier, 2020.",
        "OLIVEIRA, D. P. R. Estratégia Empresarial e Vantagem Competitiva: como estabelecer, implementar e avaliar. 9. ed. São Paulo: Altas, 2014.",
        "ANDRADE, A. R. Planejamento estratégico: formulação, implementação e controle. 2. ed.. São Paulo: Atlas, 2022.",
        "MINTZBERG, H. Safári de estratégia: um roteiro pela selva do planejamento estratégico. 2. ed. São Paulo: Artmed, 2010.",
        "PORTER, M. E. Estratégia competitiva: técnicas para análise da indústria e da concorrência. Rio de Janeiro: Elsevier, 2005."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "EPE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10ENUC0.01",
      "nome": "Energia Nuclear",
      "ch": "45h",
      "periodo": 8,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10ETER0.01"
      ],
      "corequisitos": [],
      "ementa": "Princípios básicos de um reator nuclear. Tipos de reatores. Termodinâmica de usinas nucleares. Distribuição de potência. Distribuição de temperatura em elementos combustíveis. Limites de projeto. Fluxo crítico de calor. Reações nucleares, reação de fissão, fator efetivo de multiplicação, teoria da difusão de nêutrons, remoção de calor dos reatores nucleares, canal quente e principais componentes dos reatores nucleares. Ciclos de combustível nuclear. Tipos de reatores nucleares e tecnologias de reatores nucleares. Contexto nacional da energia nuclear.",
      "bibliografiaBasica": [
        "GALETTI, D.; LIMA, C.L. Energia Nuclear. Editora UNESP, 2008.",
        "BOWMAN, C. F., BOWMAN, S. N. Thermal Engineering of Nuclear Power Stations: Balance-of-Plant Systems. CRC Press, 1ª edição, 2020.",
        "MURRAY, R. L. e HOLBERT, K. E. Nuclear Energy: An Introduction to the Concepts, Systems, and Applications of Nuclear Processes. English Edition, 8ª edição, 2019."
      ],
      "bibliografiaComplementar": [
        "BOWMAN, C. F., BOWMAN, S. N. Thermal Engineering of Nuclear Power Stations: Balance-of-Plant Systems. CRC Press, 1ª edição, 2020.",
        "MEISWINKEL R., MEYER J., SCHNELL, J. Design and Construction of Nuclear Power Plants, Beton-Kalender Series, 1ª edição, 2013.",
        "TUCKER, C. How to Drive a Nuclear Reactor. Springer Praxis Books, la ed. 2019.",
        "VAIDYANATHAN G. Nuclear Reactor Engineering (Principles and Concepts). Editora S Chand & Co Ltd, 2013.",
        "ZOHURI, B., MCDANIEL, P. Combined Cycle Driven Efficiency for Next Generation Nuclear Power Plants: An Innovative Design Approach (English Edition) 2a Edição."
      ],
      "horas": 37.5,
      "creditos": 3,
      "Sigla": "ENUC",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10CFOS0.01",
      "nome": "Combustíveis Fósseis",
      "ch": "60h",
      "periodo": 9,
      "eixo": "Energia e Mecânica Aplicada",
      "prerequisitos": [
        "G10CIMA0.01",
        "G10LAEN0.01"
      ],
      "corequisitos": [],
      "ementa": "Formação dos combustíveis fósseis, características gerais do petróleo, do gás natural e do carvão e reservas mundiais de combustíveis fósseis. A indústria dos combustíveis fósseis: exploração de combustíveis fósseis, combustão dos combustíveis, transporte dos combustíveis fósseis (oleodutos e gasodutos) e distribuição dos combustíveis fósseis. Uso final da energia dos combustíveis fósseis. Impactos ambientais destes combustíveis: derramamento de petróleo, chuva ácida, aquecimento global e dispersão de cinzas na forma de particulados. Principais desafios das indústrias do petróleo, gás natural e carvão e o papel futuro que lhes são reservados na matriz energética brasileira e mundial.",
      "bibliografiaBasica": [
        "POMINI; ARMANDO MATEUS. A Química na Produção de Petróleo. Editora Interciência, 2013.",
        "LUCIANE DE GODOI. Química do petróleo e seus derivados. Editora Intersaberes, 2022.",
        "CONSTANTINO, Mauricio Gomes; Silva, Gil Valdo José da; Beatriz, Adilson. Fundamentos de Química. Editora Atheneu, 2014."
      ],
      "bibliografiaComplementar": [
        "LUÍS AUGUSTO LOPES. A pesquisa tecnológica para o setor petrolífero sob o signo neoliberal. [S.l.]: Paco e Littera, 2021.",
        "GARCIA, Roberto. Combustíveis e combustão industrial. Editora Interciência, 2013.",
        "MANUAL de biodiesel. Editora Blucher, 2006.",
        "LAGEMANN, Virgílio. Combustão em Caldeiras Industriais - Óleo & Gás Combustível. Editora Interciência, 2016.",
        "CAVALCANTI, Eduardo José Cidade. Análise exergoeconômica e exergoambiental. Editora Blucher, 2016."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "CFOS",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10ELET2.01",
      "nome": "Eletrônica II",
      "ch": "60h",
      "periodo": 5,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [
        "G10ELET0.01",
        "G10LELE0.01"
      ],
      "corequisitos": [
        "G10LELE2.01"
      ],
      "ementa": "Amplificadores diferenciais. Amplificadores operacionais: ideal, real e diferentes configurações. Amplificadores de múltiplos estágios. Resposta em freqüência de amplificadores. Amplificadores realimentados. Filtros. Circuitos geradores de sinais e conformadores de sinais. Introdução a: diodos de potência, transistores de potência, tiristores, retificadores, controladores de tensão CA, choppers, inversores, cicloconversores. Aplicações.",
      "bibliografiaBasica": [
        "BOYLESTAD, R. L.; NASHELSKY, L. Dispositivos eletrônicos e teoria de circuitos. 11ª ed. São Paulo: Pearson do Brasil, 2013.",
        "JÚNIOR, A. P. Amplificadores operacionais e filtros ativos. 6ª ed. Porto Alegre: Bookman, 2003.",
        "SEDRA, A. S.; SMITH, K. C.; CARUSONE, T. C. Circuitos Microeletrônicos. 8ª ed. Rio de Janeiro: LTC, 2013."
      ],
      "bibliografiaComplementar": [
        "CIPELLI A. M. V.; SANDRINI W. J. Teoria e desenvolvimento de projetos de circuitos eletrônicos. 23ª ed. São Paulo: Érica, 2001.",
        "MALVINO, A. P.; BATES, D. J. Eletrônica: Diodos, Transistores e Amplificadores. 7ª ed. Concisa. Porto Alegre: AMGH, 2011.",
        "MARKUS, O. Sistemas analógicos: Circuitos com diodos e transistores. 8ª ed. São Paulo: Érica, 2009.",
        "RAZAVI, B.; SOUZA, J. R. Fundamentos de microeletrônica. 2ª ed. Rio de Janeiro: LTC, 2017.",
        "SEDRA, A. S.; SMITH, K. C. Microeletrônica. 5ª ed. São Paulo: Pearson do Brasil, 2007."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "ELET2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10LELE2.01",
      "nome": "Laboratório de Eletrônica II",
      "ch": "30h",
      "periodo": 5,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [],
      "corequisitos": [
        "G10ELET2.01"
      ],
      "ementa": "Práticas em laboratório dos temas e tópicos abordados na disciplina Eletrônica II. Utilização de softwares para simulação de circuitos eletrônicos.",
      "bibliografiaBasica": [
        "BOYLESTAD, R. L.; NASHELSKY, L. Dispositivos eletrônicos e teoria de circuitos. 11ª ed. São Paulo: Pearson do Brasil, 2013.",
        "JÚNIOR, A. P. Amplificadores operacionais e filtros ativos. 6ª ed. Porto Alegre: Bookman, 2003.",
        "SEDRA, A. S.; SMITH, K. C.; CARUSONE, T. C. Circuitos Microeletrônicos. 8ª ed. Rio de Janeiro: LTC, 2013."
      ],
      "bibliografiaComplementar": [
        "CIPELLI A. M. V.; SANDRINI W. J. Teoria e desenvolvimento de projetos de circuitos eletrônicos. 23ª ed. São Paulo: Érica, 2001.",
        "MALVINO, A. P.; BATES, D. J. Eletrônica: Diodos, Transistores e Amplificadores. 7ª ed. Concisa. Porto Alegre: AMGH, 2011.",
        "MARKUS, O. Sistemas analógicos: Circuitos com diodos e transistores. 8ª ed. São Paulo: Érica, 2009.",
        "RAZAVI, B.; SOUZA, J. R. Fundamentos de microeletrônica. 2ª ed. Rio de Janeiro: LTC, 2017.",
        "SEDRA, A. S.; SMITH, K. C. Microeletrônica. 5ª ed. São Paulo: Pearson do Brasil, 2007."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "LELET2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G05IAAP1.01",
      "nome": "Inteligência Artificial Aplicada",
      "ch": "60h",
      "periodo": 10,
      "eixo": "Eletrônica e Automação",
      "prerequisitos": [
        "G10PRCO2.01",
        "G10LPCO2.01",
        "G10SDIG0.01"
      ],
      "corequisitos": [],
      "ementa": "Conceitos e teorias de Inteligência Artificial. Técnicas de Inteligência Artificial aplicadas à Resolução de problemas. Representação do conhecimento e raciocínio em lógica. Aprendizagem de máquina. Aplicações da Inteligência Artificial na tomada de decisões e em automação de processos.",
      "bibliografiaBasica": [
        "RUSSELL, S. J.; NORVIG, P. Inteligência Artificial: Uma Abordagem Moderna. 4ª ed. Rio de Janeiro: LTC, 2022.",
        "LUGER, G. F. Inteligência Artificial. 6ª ed. São Paulo: Pearson do Brasil, 2015.",
        "HAYKIN, S. Redes neurais, princípios e prática. 2ª ed. Porto Alegre: Bookmann, 2004."
      ],
      "bibliografiaComplementar": [
        "RICH, E., KNIGHT, K., Artificial Intelligence. 2ª ed. USA: McGraw-Hill, 1991.",
        "MITCHELL, M. An introduction to genetic algorithms. London: Bradford Book, 1998.",
        "BITTENCOURT, G. Inteligência artificial: ferramentas e teorias. 3a. ed. Florianópolis: Editora da UFSC, 2006.",
        "NEGNEVITSKY, M. Artificial intelligence: a guide to intelligent systems. 3ª ed. Person, 2019.",
        "ROSA, J. L. G. Fundamentos da Inteligência Artificial. 1ª ed. Rio de Janeiro: LTC, 2011."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "IAA",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10ASUS0.01",
      "nome": "Arquitetura Sustentável",
      "ch": "30h",
      "periodo": 9,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10PIEL0.01"
      ],
      "corequisitos": [
        "G10EENE0.01"
      ],
      "ementa": "Conceitos de sustentabilidade aplicado a arquitetura e urbanismo. Definição e modelos de cidades sustentáveis. Aplicação de novas tecnologias visando o melhor aproveitamento dos recursos naturais em ambientes urbanos. Estratégias de menor impacto ambiental e maior eficiência energética aplicadas em projetos de edifícios e espaços internos urbanos.",
      "bibliografiaBasica": [
        "SOUZA, C. LEITE. Cidades Sustentáveis, Cidades Inteligentes. 1. Ed. São Paulo: Bookman, 2012.",
        "CORBELLA, Oscar; YANNAS, Simos. Em Busca de Uma Arquitetura Sustentável Para os Trópicos [2.ed.]",
        "MACAULAY, D. R. MCLENNAN, J.F. The ecological engineer. Volume one. Keen Engineering. Ecotone Publishing. 2006."
      ],
      "bibliografiaComplementar": [
        "KIBERT, C.J., J. Sustainable construction: Green building design and delivery. John Wiley and Sons, Inc. 2005.",
        "KWOK, A.G.; GRONDZIK, W.T. The greenstudio handbook. Environmental strategies for schematic design. Architectural Press. 2007.",
        "MCDONOUGH; W.; BRAUNGART, M. Cradle to cradle: remaking the way we do things. 1st. ed. New York, North Point Press. 2002.",
        "CARMODY, J. et al. Minnesota Sustainable Design Guide, version 1.0. Minneapolis, MN: University of Minnesota, Hennepin County, the Minnesota Office of Environmental Assistance, and Hellmuth, Obata & Kassabaum Architects. 2000.",
        "COLE, R.J.; LARSSON, N. GBTool User Manual. Otawa: Green Building Challenge. 2002."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "ARQS",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10TSFO0.01",
      "nome": "Tecnologia de Sistemas Fotovoltaicos",
      "ch": "30h",
      "periodo": 6,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [],
      "corequisitos": [
        "G10ESOL0.01"
      ],
      "ementa": "Tecnologia de fabricação de células e módulos fotovoltaicos. Materiais e componentes de um sistema fotovoltaico, condições de operação e configurações. Módulos, Arranjo e Células.",
      "bibliografiaBasica": [
        "BALFOUR, Jonh. Introdução ao projeto de sistemas fotovoltaicos. Rio de Janeiro: Editora LTC, 1ª edição, 2017.",
        "TIWARI, G. N., Solar energy: Fundamentals, design, modelling and aplications, Pangbourne England: Alpha Science International LTD, 2008.",
        "ALDABO. Energia Solar. Editora ArtLiber. 2002."
      ],
      "bibliografiaComplementar": [
        "FUCHS, E. F.; MASOUM, M. A. S. Power conversion of renewable energy systems. Springer, 2011",
        "NELSON, VAUGH. Introduction to renewable energy. CRC Press, 2011",
        "MARKVART, T., CASTANER, L., Solar Cell: Materials, Manufacture and Operation, Elsevier Science, 2005.",
        "ΚΕΥΝΑΝΙ, Α.; MARWALI, M. N.; DAI, M. Integration of green and renewable energy in electric power systems. Wiley, 2010",
        "VILLALVA, M. G.; GAZOLI. J. R. Energia Solar Fotovoltaica - Conceitos e Aplicações. Ed. Erica, 2012."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "TSFV",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10EIAM0.01",
      "nome": "Energia e Impacto Ambiental",
      "ch": "30h",
      "periodo": 6,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10CMCL0.01",
        "G10LAEN0.01"
      ],
      "corequisitos": [],
      "ementa": "A relação homem-natureza. Impactos ambientais: poluição das águas, do ar e do solo. Processos de alteração ambiental ocasionados pelos empreendimentos energéticos. Levantamento, classificação e análise de impactos ambientais relacionados à produção de energia. Sistema de Gestão Ambiental (A norma ISO 14001). Licenciamento ambiental de empreendimentos energéticos.",
      "bibliografiaBasica": [
        "BARTHOLO JÚNIOR, R. S. et al. A difícil sustentabilidade: política energética e conflitos ambientais. Rio de Janeiro: Garamond, 2001.",
        "SÁNCHEZ, L. E. Avaliação de impacto ambiental: conceitos e métodos. 2. ed. São Paulo: Oficina de Textos, 2013.",
        "TRENNEPOHL, C.; TRENNEPOHL, T. Licenciamento ambiental. 7ª ed. São Paulo: Revista dos Tribunais, 2018."
      ],
      "bibliografiaComplementar": [
        "FARIAS, Talden. Licenciamento ambiental aspectos teóricos e práticos. 7. Ed. Belo Horizonte: Fórum, 2019.",
        "GOLDEMBERG J.; PALETTA, F. C. Energias renováveis. São Paulo: Blucher, 2012.",
        "MAKOWER, J. A economia verde: descubra as oportunidades e os desafios de uma nova era dos negócios. São Paulo: Gente, 2010.",
        "SEEL, I. Guia de implementação e operação de sistemas de gestão ambiental. Blumenau: Edifurb, 2006.",
        "ZHOURI, A.; LASCHEFSKI, K.; PEREIRA, D. B. (Org.). A Insustentável Leveza da Política Ambiental: desenvolvimento e conflitos socioambientais. Belo Horizonte: Autêntica, 2005."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "EIA",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10BBIO0.01",
      "nome": "Biomassa e Biocombustíveis",
      "ch": "60h",
      "periodo": 8,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10CGEN0.01",
        "G10LCGE0.01",
        "G10ETER0.01",
        "G10CIMA0.01"
      ],
      "corequisitos": [],
      "ementa": "O potencial de energia contida na biomassa. Processos de transformação. Processos biológicos. Óleos vegetais. Processos físico-químicos. Introdução aos biocombustíveis. Bioetanol, Biodiesel e Matérias-primas. Óleos e gorduras. Propriedades químicas e físico-químicas dos biocombustíveis. O uso de ésteres orgânicos como combustível. Aspectos econômicos, sociais e ambientais.",
      "bibliografiaBasica": [
        "ROSILLO-CALE, BAJAY, ROTHMAN. Uso da Biomassa para Produção de Energia na Indústria Brasileira. Editora: Unicamp. 2005.",
        "VASCONCELLOS. Biomassa: A Eterna Energia do Futuro. Editora: SENAC. 2002.",
        "KNOTHE G., GERPEN J.V., KRAHL J., RAMOS L.P. Manual de Biodiesel, 2006, Editora Edgard Blucher."
      ],
      "bibliografiaComplementar": [
        "SOLOMONS. Química Orgânica - Vol. 1 e 2. 8ª. Livros Técnicos e Científicos LTDA. 2006.",
        "WALISIEWICZ. Energia Alternativa: Solar, Eólica, Hidrelétrica e de Biocombustíveis. Editora Publifolha.",
        "DEMIRBAS, A.; Biodiesel, Springer, Londres: 2008.",
        "SPEIGHT, J.G.; Synthetic Fuels Handbook: properties, process, and performance, McGraw---Hill, Nova Iorque: 2008.",
        "DRAPCHO, C. M.; Biofuels for Transportation, Worldwatch Institute, Earthscan: Londres, 2007."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "BIO",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10THID0.01",
      "nome": "Tecnologia em Hidrogênio",
      "ch": "30h",
      "periodo": 9,
      "eixo": "Energias Renováveis e Sustentabilidade",
      "prerequisitos": [
        "G10CGEN0.01",
        "G10LCGE0.01",
        "G10CIMA0.01"
      ],
      "corequisitos": [],
      "ementa": "Potenciais e princípios de funcionamento das novas tecnologias de transformação energética: Hidrogênio. Produção, transporte e armazenamento do Hidrogênio. Células de combustível. Economia e Segurança do Hidrogênio.",
      "bibliografiaBasica": [
        "RIFKIN, J., A Economia do Hidrogênio, M. Books do Brasil, 2003.",
        "ALDABÓ, R., Célula Combustível a Hidrogênio, Editora Artliber, 2004.",
        "SOUZA, M. M. V. M., Tecnologia do Hidrogênio, 1ª, ed. São Paulo: Synergia, 2009."
      ],
      "bibliografiaComplementar": [
        "CENGEL, Y. A.; Thermodynamics an engineering approach. 5. ed. Boston: McGraw Hill, 2006.",
        "KONDEPUDI, D., PRIGOGINE, I., Modern thermodynamics: from heat engines to dissipative structures. 1. ed. Chichester: John Wiley & Sons, 1998.",
        "BROWN, T. L., LEMAY, H. E., BURSTEN JR., Bruce Edward Química: a ciência central. 9. ed. São Paulo: Pearson Prentice Hall, 2005.",
        "BOCCHI, N.; FERRACIN, L. C.; BIAGGIO, S. R., Pilhas e Baterias: Funcionamento e Impacto Ambiental, Química e Sociedade, nº 11, 2000.",
        "GOMES-NETO, E. H. Hidrogênio, Evoluir Sem Poluir. Curitiba: Brasil H2, 2005."
      ],
      "horas": 25,
      "creditos": 2,
      "Sigla": "TH2",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10AELE0.01",
      "nome": "Acionamentos Elétricos",
      "ch": "60h",
      "periodo": 9,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [
        "G10CGEN0.01",
        "G10LCGE0.01"
      ],
      "corequisitos": [],
      "ementa": "Introdução a acionamentos elétricos; conjugado de carga acelerador e de frenagem em motores elétricos; regime de trabalho de motores elétricos em condição de carga; comportamento térmico de motores elétricos; variação de velocidade de motores elétricos; dimensionamento de motores elétricos.",
      "bibliografiaBasica": [
        "DEL TORO, Vincent. Fundamentos de máquinas elétricas. Rio de Janeiro: LTC, 2011.",
        "FITZGERALD, A. E.; KINGSLEY JR., Charles; UMANS, Stephen D. Máquinas elétricas: com introdução à eletrônica de potência. 6. ed. Porto Alegre: Bookman, 2006.",
        "BIM, Edson. Máquinas elétricas e acionamento. 2. ed. Rio de Janeiro: Campus: Elsevier, 2012."
      ],
      "bibliografiaComplementar": [
        "FRANCHI, Claiton Moro. Acionamentos elétricos. 4. ed. São Paulo: Érica, 2011.",
        "FRANCHI, Claiton Moro. Sistemas de acionamento elétrico. São Paulo: Érica, 2014.",
        "REZEK, Ângelo José Junqueira. Fundamentos básicos de máquinas elétricas: teoria e ensaios. Rio de Janeiro: Synergia; Itajubá: Acta, 2011.",
        "NASCIMENTO JUNIOR, Geraldo Carvalho do. Máquinas elétricas: teoria e ensaios. 4. ed. rev. São Paulo: Érica, c2006.",
        "NASAR, Syed A. Máquinas elétricas. São Paulo: McGraw-Hill, c1984."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "AcioE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10QENE10.01",
      "nome": "Qualidade da Energia",
      "ch": "60h",
      "periodo": 9,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [
        "G10SETE0.01"
      ],
      "corequisitos": [],
      "ementa": "Visão Geral dos problemas de qualidade da energia elétrica: afundamentos de tensão, interrupções momentâneas, harmônicos, flicker, transitórios de chaveamento e outros. Interrupções de energia de curta duração: causas, impactos e avaliações de confiabilidade. Afundamentos de tensão: caracterização, impacto e avaliação estocástica da severidade. Dispositivos para proteção de cargas sensíveis contra interrupções de curta-duração e afundamento de tensão.",
      "bibliografiaBasica": [
        "WAKILEH, George J. Power systems harmonics: fundamentals, analysis and filter design. Berlin: Springer, c2001.",
        "OGATA, Katsuhiko. Engenharia de Controle Moderno - 4ª edição. Editora Pearson, 2003.",
        "ARRILLAGA, J.; WATSON, N. R. Power system harmonics. 2. ed. Chichester, England: John Wiley & Sons, c2003."
      ],
      "bibliografiaComplementar": [
        "CÉLIO LUIZ BANASZESKI. Gestão da qualidade, meio ambiente e sustentabilidade. Contentus, 2020.",
        "KAGAN, N., ROBBA, E.J., Hernán Prieto SCHMIDT, H.P. Estimação de indicadores de qualidade da energia elétrica. Editora Blucher, 2009.",
        "NELSON KAGAN; CARLOS CÉSAR BARIONI DE OLIVEIRA; ERNESTO JOÃO ROBBA. Introdução aos Sistemas de Distribuição de Energia Elétrica. Editora Blucher, 2010.",
        "IEEE Std 1459-2010- IEEE Standard Definitions for the Measurement of Electric Power Quantities Under Sinusoidal, Nonsinusoidal, Balanced, or Unbalanced Conditions.",
        "IEEE Recommended Practices and Requirements for Harmonic Control in Electrical Power Systems. Std 519-1992."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "QuE",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10ATEL0.01",
      "nome": "Aterramentos Elétricos",
      "ch": "60h",
      "periodo": 9,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [
        "G10SETE0.01"
      ],
      "corequisitos": [],
      "ementa": "Introdução: considerações preliminares, conceitos básicos, aplicações típicas, aterramento de sistema e sistema de aterramento, influência do aterramento no desempenho dos sistemas elétricos. Técnicas de medição de resistividade de solo e de resistência de aterramento. Modelagem eletromagnética de aterramentos elétricos para fenômenos de baixa e alta frequências. Conceitos básicos de segurança pessoal. Filosofias de aterramento.",
      "bibliografiaBasica": [
        "VISACRO FILHO, Silvério. Aterramentos elétricos: conceitos básicos, técnicas de medição e instrumentação, filosofias de aterramento. São Paulo: Artliber, c2002.",
        "MAMEDE FILHO, João. Instalações elétricas industriais. 8. ed. Rio de Janeiro: LTC, c2010.",
        "EDUARDO DA SILVA. Equipamentos elétricos. Contentus, 2020."
      ],
      "bibliografiaComplementar": [
        "CREDER, Hélio. Instalações elétricas. 15. ed. Rio de Janeiro: LTC, 2007.",
        "NBR 5410 - Instalações Elétricas de Baixa Tensão. Associação Brasileira de Normas Técnicas. 2008.",
        "NBR 15751 - Sistema de Aterramento de Subestações - Requisitos. Associação Brasileira de Normas Técnicas. 2013.",
        "VISACRO FILHO, Silvério. Descargas atmosféricas: uma abordagem de engenharia. São Paulo: Artliber, 2005.",
        "RICARDO RANDO. Aterramento em atmosferas explosivas. Editora Blucher, 2021."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "ATER",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    },
    {
      "id": "G10DATM0.01",
      "nome": "Descargas Atmosféricas",
      "ch": "60h",
      "periodo": 9,
      "eixo": "Sistemas Elétricos",
      "prerequisitos": [
        "G10SETE0.01"
      ],
      "corequisitos": [],
      "ementa": "Introdução: considerações preliminares, efeitos principais das descargas atmosféricas e breve histórico. Aspectos do ambiente elétrico do planeta. Descrição fundamental do fenômeno físico: mecanismo básico de estabelecimento, tipificação e caracterização de parâmetros de descargas atmosféricas. Medição e detecção de descargas atmosféricas. Descargas atmosféricas diretas e indiretas: efeitos e aspectos de segurança. Princípios de sistemas de proteção contra descargas atmosféricas - interação com edificações residenciais, industriais e em ambientes explosivos. Interações com linhas de distribuição e transmissão e subestações e aspectos de proteção.",
      "bibliografiaBasica": [
        "EDUARDO DA SILVA. Equipamentos elétricos. Contentus, 2020.",
        "NEGRISOLI, M. E. M. Instalações elétricas: Projetos prediais - 3ª Edição. Editora Blucher, 1987.",
        "RICARDO RANDO. Aterramento em atmosferas explosivas. Editora Blucher, 2021."
      ],
      "bibliografiaComplementar": [
        "MAMEDE FILHO, João. Instalações elétricas industriais: exemplo de aplicação. 8. ed. Rio de Janeiro: LTC, c2010.",
        "MAMEDE FILHO, João. Manual de equipamentos elétricos. 3. ed. Rio de Janeiro: LTC, c2005.",
        "VISACRO FILHO, Silvério. Aterramentos elétricos: conceitos básicos, técnicas de medição e instrumentação, filosofias de aterramento. São Paulo: Artliber, c2002.",
        "VISACRO FILHO, Silvério. Descargas atmosféricas: uma abordagem de engenharia. São Paulo: Artliber, 2005.",
        "INSTALAÇÕES elétricas: Projetos prediais - 3ª Edição. Editora Blucher, 1987."
      ],
      "horas": 50,
      "creditos": 4,
      "Sigla": "DAtm",
      "Equivalencia": [],
      "PlanoEnsino": "",
      "Habilidades": [],
      "Competencias": [],
      "Horario": "",
      "Professor": "",
      "filiacaoDpto": "",
      "Natureza": "",
      "areaDCN": "",
      "campus": "Curvelo",
      "curso": "",
      "tipo": "Optativa"
    }
  ],
  "axisConfig": {
    "Matemática": {
      "bg": "bg-blue-500",
      "text": "text-blue-800",
      "border": "border-blue-700",
      "lightBg": "bg-blue-100"
    },
    "Física e Química": {
      "bg": "bg-red-500",
      "text": "text-red-800",
      "border": "border-red-700",
      "lightBg": "bg-red-100"
    },
    "Computação e Matemática Aplicada": {
      "bg": "bg-green-500",
      "text": "text-green-800",
      "border": "border-green-700",
      "lightBg": "bg-green-100"
    },
    "Humanidades e Ciências Sociais Aplicadas": {
      "bg": "bg-yellow-500",
      "text": "text-yellow-800",
      "border": "border-yellow-700",
      "lightBg": "bg-yellow-100"
    },
    "Energia e Mecânica Aplicada": {
      "bg": "bg-purple-500",
      "text": "text-purple-800",
      "border": "border-purple-700",
      "lightBg": "bg-purple-100"
    },
    "Eletrônica e Automação": {
      "bg": "bg-indigo-500",
      "text": "text-indigo-800",
      "border": "border-indigo-700",
      "lightBg": "bg-indigo-100"
    },
    "Energias Renováveis e Sustentabilidade": {
      "bg": "bg-teal-500",
      "text": "text-teal-800",
      "border": "border-teal-700",
      "lightBg": "bg-teal-100"
    },
    "Sistemas Elétricos": {
      "bg": "bg-orange-500",
      "text": "text-orange-800",
      "border": "border-orange-700",
      "lightBg": "bg-orange-100"
    },
    "Prática Profissional e Formação Diversificada": {
      "bg": "bg-slate-500",
      "text": "text-slate-800",
      "border": "border-slate-700",
      "lightBg": "bg-slate-100"
    }
  }
}